{"id": 31313703, "type": "c", "labeled_sentiment": 2, "text": "Exactly what I needed! Is it also possible to find out a count of matches?", "human_label_sentiment": 2}
{"id": 31314157, "type": "c", "labeled_sentiment": 1, "text": "This depends entirely on the hardware (and the interface to that hardware). For modern hardware, it's very complex. You might want to look at some old hardware documentation ( maybe for the NES? ) that has a relatively simple graphics system. Although they were typically designed for very specific applications, this will at least give you an idea for how it could be done.", "human_label_sentiment": 1}
{"id": 63881239, "type": "c", "labeled_sentiment": 0, "text": "Adjusting the time limits for a page that renders normally (without feeding it into DomPDF) is not a solution and even makes it worse as DomPDF will just crash longer, consume more memory and maintain the high CPU load longer. I can confirm that nested tables, tables spanning pages, overlowing content are all sore points in DomPDF (I even had false positives on virus detection due to HTML content corner cases).\nMPDF seems no longer active, I have better results with http it's worth the pain to setup it up.", "human_label_sentiment": 0}
{"id": 20909561, "type": "p", "labeled_sentiment": 1, "text": "I did what I said in my comment http , downloaded DocX http , created a Microsoft Word document and ran this code from a project referencing the DocX library: And the Word file, prior containing: Afterwards contains: So, works for me. Edit: I ran your code on a file containing the first line from your question, and it works. Are you sure you're running this code and that you're looking at the correct file?", "human_label_sentiment": 1}
{"id": 31751912, "type": "c", "labeled_sentiment": 1, "text": "These are accounting questions, not programming questions. Ask your accountant to show you how he wants them entered into QuickBooks. Once you have screenshots of that, it should be blatantly obvious what you need to do in the code. With respect to totals - just like in the QuickBooks GUI, all totals are derived from the sum of the line items.", "human_label_sentiment": 1}
{"id": 20948361, "type": "p", "labeled_sentiment": 0, "text": "Boolean data type only evaluates to or , so it is always going to take only one bit of memory. So why is there a need of extra 7 bit of memory, isn't it a waste of memory?", "human_label_sentiment": 0}
{"id": 31494255, "type": "c", "labeled_sentiment": 0, "text": "@user Oh, you criticize without knowing a bit. What you suggest would only replace the first coincidence. With your code fails. Please learn before criticizing", "human_label_sentiment": 0}
{"id": 31378475, "type": "c", "labeled_sentiment": 1, "text": "let us continue this discussion in chat", "human_label_sentiment": 1}
{"id": 20961489, "type": "p", "labeled_sentiment": 2, "text": "I am building an MVC 4 application, using EF 5.\nI need to do an audit trail, ie log any changes that end users make. I have asked this question a few times, but haven't really gotten a satisfying answer before.  So I am adding a lot more details in hoping to get somewhere.. currently I have multiple repositories ie Now I know for me to add the code to check to see if there are any changes i need to add it in the try of the save.  Before the context.SaveChanges(). But currently I have 10 repos.  I don't really want to add code to 10 different places.  As this code will do exactly the same thing.  I want to somehow have a baseclass that the repos inherit from. any help? any sample code? any pointers? would be appreciated.  I am sure other people would have done this before I am mappying my keys, relationships and tables like so", "human_label_sentiment": 1}
{"id": 31468200, "type": "c", "labeled_sentiment": 0, "text": "Provide an example of your problem. In theory virtual functions could have any signature. I think you are doing something wrong", "human_label_sentiment": 1}
{"id": 20982307, "type": "p", "labeled_sentiment": 0, "text": "Doing some research into antialiasing methods, I stumbled upon this piece of code (grabbed from Nvidia's FXAA shader): Is there a good reason it's not written as the following instead? I assume it's an optimization of some sort? Just seems really counterintuitive...", "human_label_sentiment": 0}
{"id": 20996065, "type": "p", "labeled_sentiment": 2, "text": "I have made a with few points by setting its stroke color to red . Then i have filled the color with a pattern of an . I want to rotate that along with its filled pattern using . I have used CATransform3DRotate but it is not working properly. Thanks in advance", "human_label_sentiment": 1}
{"id": 20971245, "type": "p", "labeled_sentiment": 2, "text": "I searched many sites (stackoverflow as well) but couldn't understand how to implement the navigation drawer without the action bar. I know that this question has already been asked here but it doesn't have a proper explanation and code. I am a beginner in android development so can anyone please explain me with code How to make a navigation drawer without an action bar Thanks in advance!", "human_label_sentiment": 1}
{"id": 20941471, "type": "p", "labeled_sentiment": 0, "text": "This question may be slightly philosophical in nature, but would it be crazy to just capture a photo from the live preview instead of going through ? I've found a few examples of how to do so: How to capture preview image frames from Camera Application in Android Programming? http and Capture an image from the camera preview http . Right now I'm juggling through inconsistent different EXIF rotation behavior on various phones (it looks like you have a for all Samsung devices, but I'm having different behavior between my S2 and S4) and I'm wondering if it wouldn't just be easier to grab the preview image. Is this a stupid idea?", "human_label_sentiment": 0}
{"id": 31658984, "type": "c", "labeled_sentiment": 0, "text": "Sorry, my previous comment was incomplete.  The number of list1 elements and order may well differ by list2 sequence may well differ.  For instance, assume 10 list1 sequences.  I may write list1 sequences 1 + 2 to the 1st list2 sequence.  However, the 2nd list2 sequence may have list1 sequences 1 + 3 + 8.", "human_label_sentiment": 1}
{"id": 31564360, "type": "c", "labeled_sentiment": 0, "text": "Really hard to figure out what you want here.", "human_label_sentiment": 0}
{"id": 21025871, "type": "p", "labeled_sentiment": 2, "text": "In the end, to avoid the hassle. I added a JButton and changed the keyPressed to an actionPerformed. So everytime I click that button, it finds and highlights me the string I enter in the TextField. Thank you for your help guys, I appreciate it.", "human_label_sentiment": 2}
{"id": 31619740, "type": "c", "labeled_sentiment": 2, "text": "This is interesting, I have not think about a limit.", "human_label_sentiment": 2}
{"id": 32811058, "type": "c", "labeled_sentiment": 2, "text": "@user Thanks for this answer. In many cases it will be sufficient. However, it answers only the question of the headline, not the more general question on how to break on multiple load events, which is e.g. needed if we include Silverlight (coreclr.dll) in this list.", "human_label_sentiment": 2}
{"id": 31615453, "type": "c", "labeled_sentiment": 1, "text": "Sounds like the compiler is expecting syntax (where every instruction has a suffix showing its size, register names start with , and the source and destination operands are reversed).  It'd look like etc, or something quite close to that.", "human_label_sentiment": 1}
{"id": 31574582, "type": "c", "labeled_sentiment": 1, "text": "Sure. Can you tell me more about when you would want to update the expiration date? What would initiate the plan expiration? Would that expiration happen in response to some rails UI or to an API? We don't necessarily need a controller method for this.", "human_label_sentiment": 1}
{"id": 31526746, "type": "c", "labeled_sentiment": 2, "text": "Thanks guys. @user I've tried splitAt before and it did not rotate the chunks as I was looking to have. However, when used in conjunction with tags it seems to work very well! The downside is that it is EXTREMELY slow. I'm thinking now of directly inserting into the \"config.chunks\" collection but I'm not sure how wise that would be? Keep in mind that I will do this before loading any data at all.", "human_label_sentiment": 2}
{"id": 31650909, "type": "c", "labeled_sentiment": 2, "text": "Yeah, no issues. It works great!  Thanks for the help. I really appreciate it.", "human_label_sentiment": 2}
{"id": 21089926, "type": "p", "labeled_sentiment": 0, "text": "I've facing a boring problem over here... i'm trying to cast a recordset into array, but the object type is not returned correctl I've a Recordset type function, and i try to receive the results of this function by the recordset object. But when i try to test the object type, the typeof function returns \"Fields\" type. Search Method:", "human_label_sentiment": 0}
{"id": 31750623, "type": "c", "labeled_sentiment": 0, "text": "Does a reference to a shared_ptr keep it alive?  Regardless - If I were starting again, then some type of reference counting would probably be the way to go.  Unfortunately I think it's too big of a change to the existing code-base right now.", "human_label_sentiment": 0}
{"id": 21121422, "type": "p", "labeled_sentiment": 2, "text": "I have a SQL-Server table which needs to be updated via a SQLCLR function.  An update to a single row will need to trigger table-wide update.  I was wondering how to properly perform the update and normalize the table.  The main problem I see is that it's linked to a website, so there could be multiple updates coming in at any time.  The website will only see a few hundred visitors and after a short period of time will be closed (collecting data for research). To get an idea of the SQLClr call: I would need to select this data into a temp table, normalize that table and then perform an update to the original table with the values (newValue*.5 + oldValue*.9) then renormalize the whole table.  I imagine this would take a while to process, so I'm looking for the most efficient way of doing that, plus a solution to the multiple updates flying in issue. Any advice you could give me would be great! Thanks", "human_label_sentiment": 2}
{"id": 21060087, "type": "p", "labeled_sentiment": 2, "text": "I want to click a button and make the value of one UISegmentedControl go into a second identical UISegmented control. Here is the code I tried, which does nothing: Thanks in advance!", "human_label_sentiment": 2}
{"id": 21369286, "type": "p", "labeled_sentiment": 1, "text": "Note that to get a bit more visibility on what the file descriptors are (if you continue to play with strace), you can use the -y option of recent strace versions (at least 4.8 has it). -y will decode the the file descriptors to a path.", "human_label_sentiment": 1}
{"id": 31798937, "type": "c", "labeled_sentiment": 0, "text": "unfortunately, i am on windows 7. unable to debug the parallel call.", "human_label_sentiment": 0}
{"id": 31766589, "type": "c", "labeled_sentiment": 0, "text": "Also, why is enclosed in what appear to be quotes? Unless I'm mistaken (I'm used to PHP/Microsoft SQL), that's unnecessary and may be part of your problem if your DBMS is trying to do a clause comparing two different string literals. That will always return false.", "human_label_sentiment": 0}
{"id": 33334768, "type": "c", "labeled_sentiment": 2, "text": "Yes this is what i already did Vijay. Nginx was a killer. Cheers", "human_label_sentiment": 2}
{"id": 21165702, "type": "p", "labeled_sentiment": 1, "text": "I know how to get bigram and trigram collocations using NLTK and I apply them to my own corpora. The code is below. I'm not sure however about (1) how to get the collocations for a particular word? (2) does NLTK have a collocation metric based on Log-Likelihood Ratio?", "human_label_sentiment": 1}
{"id": 22121307, "type": "p", "labeled_sentiment": 2, "text": "I encountered the same exception today. I deleted resin.jar from WEB-INF/lib directory of quercus and it deployed successfully. \nI hope this helps.", "human_label_sentiment": 2}
{"id": 31821235, "type": "c", "labeled_sentiment": 0, "text": "if I'm not wrong, this change every href to #something ? if this is it, so that's not what I want..", "human_label_sentiment": 0}
{"id": 21338205, "type": "p", "labeled_sentiment": 2, "text": "I ended up just doing an experiment and WF does in fact support multiple terminal states (at least 4.5 does).  I had a state machine setup with a single entry state (Opened), then it transitioned to three final states (Closed, Faulted, Canceled). It worked great.", "human_label_sentiment": 2}
{"id": 21143969, "type": "p", "labeled_sentiment": 0, "text": "So I have this javascript variable I'm generating on my views that I want to send to a rails variable the form submit.  I understand that I can do this using jquery or ajax but my attempts have failed.  Here is what I am trying: Rails variable: Some HTML: My javascript: To my expectations this is not working.  Could someone show the steps I should use to use jquery or ajax to send my javascript var to my rails variable ?", "human_label_sentiment": 0}
{"id": 32540912, "type": "c", "labeled_sentiment": 2, "text": "I mean; ... have unit testing with this type of design :D", "human_label_sentiment": 2}
{"id": 31842446, "type": "c", "labeled_sentiment": 1, "text": "Nice solution, maybe you wanna replace with ? Think about input: \"i. robot.\"", "human_label_sentiment": 2}
{"id": 31860384, "type": "c", "labeled_sentiment": 1, "text": "@user — Well, it will throw one, but that contradicts what the OP says \"If I change the hash[1] and write the name of the div in the GetElementById it works fine\" (which implies that this isn't the problematic code)", "human_label_sentiment": 1}
{"id": 43896167, "type": "c", "labeled_sentiment": 1, "text": "is the relevant one", "human_label_sentiment": 1}
{"id": 43919946, "type": "c", "labeled_sentiment": 2, "text": "You are right, I know, because other details are irrelevant. I didnt want to overcomplicate the question because I wouldnt get a single response back :) What important is that Weather action has nothing to do with Google Oauth, Google Oauth is used in two other actions (Calendar and Gmail). And yes, it's unclear to me why the request to google oauth is involved here at all. Besides, think about it - just renaming the action results in JS request error? WTF? The other thing - when running the site (having Weather action) from another machine, at different IP, the damn thing works :)", "human_label_sentiment": 2}
{"id": 27785654, "type": "p", "labeled_sentiment": 2, "text": "I was going through classes in sql package. And i happened to look through the methods in DriverManager.class by \"javap DriverManager.class\". It shows a method of Driver class- get Driver , if i am not wrong. (Do correct me and tell me the correct info if i am). Now i looked through Driver.class and couldn't find that method. Where is that stored ? Thanks in advance.Image attached !!", "human_label_sentiment": 2}
{"id": 44008265, "type": "c", "labeled_sentiment": 0, "text": "You're going to have to provide alot more if you want help with this; it's really hard to derive what you're actually doing with this.", "human_label_sentiment": 0}
{"id": 46358743, "type": "c", "labeled_sentiment": 1, "text": "Min SDK is 16. My Nexus has Version L (5.0.1) and my HTC is 17 (4.2.2). Is that the problem ?", "human_label_sentiment": 1}
{"id": 44008157, "type": "c", "labeled_sentiment": 1, "text": "yes i know, any thing wrong i posted sir?", "human_label_sentiment": 1}
{"id": 44010865, "type": "c", "labeled_sentiment": 0, "text": "Yes I did. I don't get an error. That's the thing. By clicking on submit, the login page is loaded again and nothing happen. Very weird.", "human_label_sentiment": 0}
{"id": 44059232, "type": "c", "labeled_sentiment": 2, "text": "Thank you @user I didn't look closely enough at the link.  I assumed the function was part of the GSL library.  Edited to fix this oversight", "human_label_sentiment": 2}
{"id": 44000264, "type": "c", "labeled_sentiment": 2, "text": "Hi Cristi, thanks for the response! I am using a service for the communication and I already handle the promise in that service. It is a general service for all the communication so I cant 'overwrite' the promise when feeding the combo box.\nIs there any other solution for that? I thought there is a 'built-in' solution for handling problems like that.", "human_label_sentiment": 2}
{"id": 27825506, "type": "p", "labeled_sentiment": 0, "text": "I have some simple JS for redirecting a user away from a page based on a few conditions. Basically, if a user ends up on the first link, checked in I want to see if they came from the address and if not then redirect them using . Problem is this code seems to work no matter what(e.g. user always gets redirected). I have no idea what value is getting and am not seeing any errors in the developer console in Chrome. Is there something dumb that I'm doing wrong? I have confirmed that is the exact URL I'm looking for and have tried it both with a backslash at the end and without it.", "human_label_sentiment": 0}
{"id": 44554143, "type": "c", "labeled_sentiment": 0, "text": "You don't need to run mvn eclipse:eclipse, the feature and plugin projects from the GitHub projects are ready-to-import Eclipse projects already. You might end up with compile errors, but that is very likely related to the target environment that you have defined for plugin development in Eclipse or STS, since Spring IDE plugins depend on Eclipse plugins. But that is a bit too much for this comment, I would recommend to open up a new thread for this.", "human_label_sentiment": 1}
{"id": 27848871, "type": "p", "labeled_sentiment": 2, "text": "Found my solution: I wasn't parsing new lines out of my sql dump, and it caused issues with hive. Thanks guys!", "human_label_sentiment": 2}
{"id": 27827992, "type": "p", "labeled_sentiment": 0, "text": "I am going through a class to learn about JAVA... I was told to add a method (void swapNames(Greeter other)) that swaps the names of this greeter and another. Then to create two objects in the Greeter class and use the swapNames method to swap their names. I started with .. BUT I am getting stuck. How can I finish this \"swapNames()\" to change the name of the two objects?", "human_label_sentiment": 0}
{"id": 44124136, "type": "c", "labeled_sentiment": 0, "text": "i tried this but its not working. see this page , i'm tried in plunker. i hope my code was not correct. please re-correct my code.", "human_label_sentiment": 0}
{"id": 27853603, "type": "p", "labeled_sentiment": 1, "text": "I want to draw an text on an item icon in action bar. my current actionbar is this: I want to be like this: i tried this code: but not working. is there any solution?", "human_label_sentiment": 0}
{"id": 27879710, "type": "p", "labeled_sentiment": 0, "text": "I’ a little confused with UIView’s bounds and frame. I’m creating UIButton manually with the same size as its super view: But in the simulator the button and its super view have different size. I don’t really understand this.. (I didn't use IB to create the button because next I’d like to create a 2D array of buttons within that super view, so I think maybe it’s better to create them manually)", "human_label_sentiment": 0}
{"id": 44137985, "type": "c", "labeled_sentiment": 0, "text": "There is no need to use at all. has a constructor that takes in integers for year/month/day.  I'm also not the biggest fan of and the other stuff in the namespace.", "human_label_sentiment": 0}
{"id": 27820035, "type": "p", "labeled_sentiment": 1, "text": "I have a Java Maven Project started in Eclipse, worked on it a few days, then imported it in IntelliJ IDEA, again working on it a few days. The normal Run/Execution in IDEA and via shell does work, but not the Debug. When I click the Bug Icon for Debug, it opens up URLClassLoader.java file and points on the Line \"throw new ClassNotFoundException(name)\" and pauses the Debug, if I click Resume Debug, it shows several Classes that do not belong to my project. I can click the Resume Button endless, it shows the same classes, also ClassNotFoundException over and over again in a continuously loop and does not debug my source. If I click Build -> Rebuild Project it says at the Debug icon\n\"Hot Swap failed\nmyClassname: schema change not implemented;\nmyClassname: Operation not supported by VM\" In the Debug window under Variables it says: \"Frame is not available\" The Debug of this project in IntelliJ IDEA did work previously, whats wrong now?", "human_label_sentiment": 1}
{"id": 44032217, "type": "c", "labeled_sentiment": 0, "text": "@user - you have missed out the first step.", "human_label_sentiment": 0}
{"id": 53582479, "type": "c", "labeled_sentiment": 1, "text": "hey, did you ever find a answer to this?  I am in the same boat as you.", "human_label_sentiment": 1}
{"id": 44174229, "type": "c", "labeled_sentiment": 1, "text": "What do you aim to gain by doing so?", "human_label_sentiment": 1}
{"id": 44085924, "type": "c", "labeled_sentiment": 1, "text": "i have found a clue here [http://stackoverflow.com/questions/11511805/using-timestampdiff-in-a-derby-where-clause]", "human_label_sentiment": 1}
{"id": 44084267, "type": "c", "labeled_sentiment": 0, "text": "@user I don't quite follow, sorry. It's likely I'm misunderstanding exactly what and how to use XMLHTTPRequest. I suppose it might be possible to have cron fetch the file via curl and then just use a regular open.....", "human_label_sentiment": 0}
{"id": 44233261, "type": "c", "labeled_sentiment": 1, "text": "I would just get all results and use AJAX to sort them", "human_label_sentiment": 1}
{"id": 27909806, "type": "p", "labeled_sentiment": 2, "text": "I'm trying to store address values generated by a postcode lookup and then create a list that I can use the python Random module to select a random value using random.choice Scenario: Enter postcode, click 'Search' - dropdown list is dynamically populated with available options. I'm using a dictionary to store my form values as xpaths and then using the webdriver to or . Code looks something like this (not properly formatted, just reference): Using the random module on my postcodes isn't a problem. If anyone can give some guidance or point me in a direction to take for reference it would be much appreciated - I'm only a noob to Selenium and Python - made steady progress but seem to be going round in circles on this problem - my first issue was using a simple 's' missing off 'element' threw me for a while.", "human_label_sentiment": 2}
{"id": 44260188, "type": "c", "labeled_sentiment": 2, "text": "@user - good!  I added to make sure numeric columns end up numerics, and not characters", "human_label_sentiment": 2}
{"id": 44270816, "type": "c", "labeled_sentiment": 1, "text": "Possibly try some templating framework?", "human_label_sentiment": 1}
{"id": 44092621, "type": "c", "labeled_sentiment": 0, "text": "Personally, I don't know any way to bypass Firebird's authentication. But that would feel very odd to me, anyway. Most database systems require authentication. There has to be some configuration file to the program, where credentials (e.g. Firebird default user ) can be stored.", "human_label_sentiment": 1}
{"id": 27947942, "type": "p", "labeled_sentiment": 1, "text": "I want to make it so when a button is held down it starts playing sound and when released to stop. I know that there are a few people with the same problem but i didnt find a solution to the problem. Here is my code: }", "human_label_sentiment": 1}
{"id": 45082587, "type": "c", "labeled_sentiment": 1, "text": "Everything you've posted looks OK. Is your I01Test.java under src/androidTest/ or src/main? It should be the former.", "human_label_sentiment": 1}
{"id": 44264409, "type": "c", "labeled_sentiment": 1, "text": "Actually I believe it is bound to the target IP address of the SYN packet, which isn't necessarily the same as the IP that accepted the connection request, due to the 'weak end system model'.", "human_label_sentiment": 1}
{"id": 28066670, "type": "p", "labeled_sentiment": 2, "text": "Well,\napparently there was a simple solution to solve my current problem: works !  Note the use of singe-quotes inside the double quotes.\nIOW, as long as there is a then can be anything except containing more double quotes. Thanks for the comments.", "human_label_sentiment": 2}
{"id": 27881226, "type": "p", "labeled_sentiment": 2, "text": "I have one project lets say A. It already has 50 different modules. Now I have to create one more module inside it. My new module pom.xml has a parent entry for A pom.xml which is the main one. Also in eclipse only A is having properties information for build path. Other modules didnt have this. So my problem is I want to add one jar in my newely created module. So that dependency entry will be in this sub module pom or in main pom file. When I tried with sub module pom, it is not working and the main pom already have some issue related to downloading for all  other 50 modules. So I m stuch here. Please help me. Thanks in advance.", "human_label_sentiment": 2}
{"id": 27985945, "type": "p", "labeled_sentiment": 2, "text": "I'm wandering if you can help me with this. I need to search using 2 fields of my DB, Cod + number. I show this in one column, for ex. cod ACE + number 003, it shows ACE003, so how can I search in one textfield for the two option. Now if you enter ACE003 in the field, nothing return, but if you type ACE, of course it works. This is my code.. index.html Controller You can see many field that I use to search. I have to use one field to search for cod + number. Model Search section How can I search by cod + number using one textfield?. Thanks in advance! UPDATE (SOLVED) In my view in the postgress DB I use", "human_label_sentiment": 2}
{"id": 44345325, "type": "c", "labeled_sentiment": 1, "text": "what do you mean with no space?", "human_label_sentiment": 1}
{"id": 28011319, "type": "p", "labeled_sentiment": 1, "text": "I think you will have to add also to the request call,because you are trying to send format data to server,like below. : data format, you are expecting form server : data format ,you are sending to server", "human_label_sentiment": 1}
{"id": 44421448, "type": "c", "labeled_sentiment": 1, "text": "Using the command worked, I just had to replace the part with the location chefdk was stored in my system.", "human_label_sentiment": 1}
{"id": 27960058, "type": "p", "labeled_sentiment": 2, "text": "I was wondering what would be the best way to grab values from a JSON response like this? I already have the response stored in a variable: How do I echo these values in PHP? Let's say I want merchantRefId. Thanks!", "human_label_sentiment": 2}
{"id": 28039520, "type": "p", "labeled_sentiment": 1, "text": "I am following cloudera cdh4 installation guide. My base file My hadoop installation file java_ubuntu is the image build from my base file. Supervisor part\n  hadoop_ubuntu is the image build from my hadoop installation docker file Program is successfully build. But namenode is not starting up? How to use supervisor?", "human_label_sentiment": 1}
{"id": 30257183, "type": "p", "labeled_sentiment": 1, "text": "Problem could be caused by a fact that you simply do not have pg_dump and pg_restore tools installed (or they are not visible for pgadmin). This had happen to me when installing pgadmin3 on CentOS 7 via PostgreSQL yum repository http . To resolve this I had to install package with those tools - in my case postgresql94 (PostgreSQL client programs and libraries). On other distros you will need to find which package should be installed. AFAIK this issue is not present in Windows environment, pgadmin installer probably have all needed dependencies.", "human_label_sentiment": 1}
{"id": 44457662, "type": "c", "labeled_sentiment": 1, "text": "You shouldn't have to do anything. Just build the project. Are there errors in both files? The one defining the namespace has to build before the namespace can be referenced. Also, please edit your question to show the exact error message.", "human_label_sentiment": 1}
{"id": 28055248, "type": "p", "labeled_sentiment": 0, "text": "I trying to add to my app 'carrierwave' gem.I create a class image_uploader and create a model photo.rb and photo.rb has polymorphic association with post.rb post.rb has a nested attributes from photo.rb and this is partial _form.html.haml from post.rb model but when I create a post with image, shell show me an error how fix it? sorry for my bad English UPD schema.rb SOLVED", "human_label_sentiment": 0}
{"id": 56989082, "type": "c", "labeled_sentiment": 0, "text": "just above the section in the app note you called out, it says numbers were taking against a 168MHz system clock.  So maybe Load (MHz) is meant to mean a raw number of the 168 million system clock 'ticks', taken per second, used to run that codec.  In other words, 168MHz = 100% CPU, 84MHz=50% CPU?  If that's the case, this is a really bizarre measurement.", "human_label_sentiment": 0}
{"id": 56939349, "type": "c", "labeled_sentiment": 0, "text": "I understand that the calls an array of functions in series, each passing their results to the next in the array. What I don't understand is how the first has the SQL query as a parameter and . cb stands for callback, but where is this function defined and what does it do? It is also used later on a lot of times.\nAlso, I understand that works like a and applies the second paramter/function to each item in the Array, but I don't get the and what does it do? Then later on another - why is a waterfall inside another?", "human_label_sentiment": 0}
{"id": 56935216, "type": "c", "labeled_sentiment": 0, "text": "@user Yes, if conditionals looks good to the asker, then something is wrong. Everything points to this not being a single type. Which is why I don't think it is helpful to offer single type solutions.", "human_label_sentiment": 0}
{"id": 56917175, "type": "c", "labeled_sentiment": 1, "text": "it would have to open bash I guess and then just run \"node server.js\"...if it's that easy? How can this be done without creating a bash script?", "human_label_sentiment": 1}
{"id": 56974078, "type": "c", "labeled_sentiment": 1, "text": "What happens with ?", "human_label_sentiment": 1}
{"id": 56997102, "type": "c", "labeled_sentiment": 2, "text": "just updated the code description ^^", "human_label_sentiment": 2}
{"id": 57013984, "type": "c", "labeled_sentiment": 1, "text": "XPath selects nodes, so phrase your question in terms of the specific criteria that distinguishes that which you wish to select .", "human_label_sentiment": 1}
{"id": 57378454, "type": "c", "labeled_sentiment": 2, "text": "@user Excellent and thorough response - I've since discovered there are at least two pieces to my problem. I've explained them both them in my question.", "human_label_sentiment": 2}
{"id": 56997501, "type": "c", "labeled_sentiment": 0, "text": "I did try the above mentioned method ,first i emptied arp table and ran ping broadcast IP then when i typed arp -a result was --- 192.168.90.255 ping statistics ---\n127 packets transmitted, 127 packets received, +254 duplicates, 0.0% packet loss\nround-trip min/avg/max/stddev = 0.183/8.220/341.990/25.879 ms\nMac:~ root# arp -a\n (192.168.90.1) at 94:10:3e:4:a9:d2 on en0 ifscope [ethernet]\n (192.168.90.100) at 28:e3:47:9:72:ae on en0 ifscope [ethernet]\n (192.168.90.255) at ff:ff:ff:ff:ff:ff on en0 ifscope [ethernet]\nmoreover it is taking lot of time which does not match for my requirement.", "human_label_sentiment": 0}
{"id": 56932619, "type": "c", "labeled_sentiment": 0, "text": "@user yes, but it's a bad solution. The package provided by Symfony should be compatible with the lowest dependencies declared (to be compatible with PHP 5.3). Then if someone wants higher dependencies, they can always update their Composer deps.", "human_label_sentiment": 0}
{"id": 34615401, "type": "p", "labeled_sentiment": 2, "text": "Preamble: I have a large multi-variate zoo object. It contains several years of 60 minute interval data. I like to keep my data in large chunks and subset from the large chunk as I need to perform work. Normally, I'm doing prety basic stuff like just making graphs, but I'd like to move towards a deeper understanding of my data. So. I'm taking my large data.csv file here http . And doing the following: Say I want to subset this big chunk to only data from 2012. If I subset the df data.table I get this (Note that the times start at 2012-01-01 00:30:00, as expected): When I subset using the function, I get a different result (Note that the times start at 2012-01-01 03:30:00). It's really grinding my gears as I can reproduce it for other years, too. Thanks for any insight!", "human_label_sentiment": 2}
{"id": 34618420, "type": "p", "labeled_sentiment": 1, "text": "I am using Google Calendar Push Notifications. All is working well and I register my channel with no issue. Changes to the calendar result in a notification as expected. I want to stop the push notification. I am calling Google stop push notification API. \n\" http \"\nBut I am getting Error code: . Request: Response: Can anyone help me why I am getting this error?\nThanks.", "human_label_sentiment": 1}
{"id": 57021193, "type": "c", "labeled_sentiment": 0, "text": "I do not follow. What is going on exactly? Are you entering the function? won't show correctly?", "human_label_sentiment": 0}
{"id": 34627120, "type": "p", "labeled_sentiment": 2, "text": "Well to start, I'd like to say welcome to the newest version of laravel (released apx 3 weeks ago). Second: authentication is handled completely for you in this version of laravel, and it is well documented http for you to customize. As far as switching from live / maintenence mode, as always we suggest keeping a live Repo and a branch for development. May we suggest using Bitbucket http coupling it with our forge http service in order to ease deploying and setting up your servers! As far as a CDN goes, that's all based on your experience. I don't recommend one over the other because my opinion would be biased and the current version is fairly new, so any packages/dependencies for previous versions would need to be updated and/or tested for compatibility  :) I hope this helps!", "human_label_sentiment": 2}
{"id": 57043250, "type": "c", "labeled_sentiment": 1, "text": "are you using jquery or other framework?", "human_label_sentiment": 1}
{"id": 34686724, "type": "p", "labeled_sentiment": 2, "text": "I was trying to find a solution to run different task in different threads (depends/independents) I have scenario where I need to run one task (which internally runs a server) in different thread before running another task (test, depends on above server) in gradle, after 2nd task completed I need to kill first task. Again, same as above scenario, run another set of server/test/kill tasks. Hope, All above make sense... I am open for another approach if its possible in build.gradle.", "human_label_sentiment": 1}
{"id": 57033310, "type": "c", "labeled_sentiment": 0, "text": "I don't think that HTML is valid.", "human_label_sentiment": 0}
{"id": 57106957, "type": "c", "labeled_sentiment": 0, "text": "Still not understanding. These examples are not changing PHP variables so I dont understand how they are relevant to me. Please enlighten me.", "human_label_sentiment": 0}
{"id": 57168472, "type": "c", "labeled_sentiment": 1, "text": "Have you tried going into debug closing the app and looking which thread remains running (has to be some non demon). That might give a hit why it is not closing.", "human_label_sentiment": 1}
{"id": 57130148, "type": "c", "labeled_sentiment": 2, "text": "Thanks so much for the help and being patient. Is there anyway I can get in contact with you by email or something in case I get stuck along the way? Im new at thesis you can tell and you been super helpful!", "human_label_sentiment": 2}
{"id": 34722253, "type": "p", "labeled_sentiment": 1, "text": "Here main working of function is like : -Skip the common part between both strings and assign the first string with new string. As this loop just increasing the index of common part so this will skip storing of data in s1.", "human_label_sentiment": 1}
{"id": 57162435, "type": "c", "labeled_sentiment": 2, "text": "nice and easy, well done!", "human_label_sentiment": 2}
{"id": 57211242, "type": "c", "labeled_sentiment": 0, "text": "The player is just a sprite made with PIXI.js and player.vx and player.vy are just the x and y of the sprite. I don't know why I didn't try a switch. I'll be right back.", "human_label_sentiment": 0}
{"id": 57183286, "type": "c", "labeled_sentiment": 1, "text": "To me, it looks like the is not configured correctly.. It is targeting thus the classic iOS, where it should be . The inside the does properly ref so you can zip the and add a manual reference to it in project to unblock yourself.... Also fill a github issue.", "human_label_sentiment": 1}
{"id": 58892735, "type": "c", "labeled_sentiment": 0, "text": "I just went with the standard way, i.e during deployment in second pipeline I run my server on their virtual machine (in my case it's the npm task '). Then I wait around 30s to make sure server is up and running. After this pause, I run straight away and it works. Parallel spec runner seems to be problematic though.", "human_label_sentiment": 0}
{"id": 57255544, "type": "c", "labeled_sentiment": 1, "text": "Anyone may provide some sure opinion for yes or not ?", "human_label_sentiment": 1}
{"id": 57462555, "type": "c", "labeled_sentiment": 2, "text": "I don't want to add Bonjour as a dependency in the project. That would be my last option. But thank you any way.", "human_label_sentiment": 2}
{"id": 57239543, "type": "c", "labeled_sentiment": 2, "text": "Thank you for the response.  We indeed have the true setting in both our 5.0.1 GREG instance (running the API Publisher/Store plugins) and our 5.0.0 IS instance.", "human_label_sentiment": 2}
{"id": 57292869, "type": "c", "labeled_sentiment": 0, "text": "Checked on Firefox, Chrome... AND on another machine. Lol. This is pretty weird behavior..", "human_label_sentiment": 0}
{"id": 57286793, "type": "c", "labeled_sentiment": 1, "text": "@user The one inside the foreach loop.", "human_label_sentiment": 1}
{"id": 57294216, "type": "c", "labeled_sentiment": 2, "text": "Thanks for pointing out", "human_label_sentiment": 2}
{"id": 57232460, "type": "c", "labeled_sentiment": 0, "text": "Sorry for been messy. No need to return anything. Just call the $render. In the documentation it is written that the $setViewValue don't call the $render function.", "human_label_sentiment": 0}
{"id": 47347612, "type": "p", "labeled_sentiment": 2, "text": "Just remove these lines from tag. The flash effect will be remove when you turn back. Hope it works on your side.", "human_label_sentiment": 2}
{"id": 57230934, "type": "c", "labeled_sentiment": 1, "text": "But good effort at trying to make a reproducible example. I cannot recreate this error. At a guess maybe you typed or instead of or when creating from your . Maybe use the function instead?", "human_label_sentiment": 1}
{"id": 57275608, "type": "c", "labeled_sentiment": 0, "text": "Ok, sorry I have not used stackoverflow before. I'll to it tonight.", "human_label_sentiment": 0}
{"id": 34791533, "type": "p", "labeled_sentiment": 1, "text": "It works Possible mistakes may be you are adding script on top of page i.e. in head.\nIn this case document.getElementById(\"pp\") would not work because body have not loaded at the time of execution.\nTry adding the script after the last element of the body or document.onload callback.", "human_label_sentiment": 1}
{"id": 57401888, "type": "c", "labeled_sentiment": 0, "text": "The square brackets ( ) are used for list indexing , not function calls, so your is nonsense. What's more, is a SyntaxError, you're appending to what ?", "human_label_sentiment": 0}
{"id": 57395318, "type": "c", "labeled_sentiment": 1, "text": "There is no permission.", "human_label_sentiment": 1}
{"id": 57471040, "type": "c", "labeled_sentiment": 2, "text": "Thanks, I am not quite ready to implement this but it is coming shortly. I'll test it out but the solution looks very promising indeed.", "human_label_sentiment": 2}
{"id": 57476526, "type": "c", "labeled_sentiment": 2, "text": "@user Not only was my answer correct, but I even tested the code. Completely works. Read the question again in the context that I read it, and do consider removing your dislike. Thank you.", "human_label_sentiment": 0}
{"id": 57451779, "type": "c", "labeled_sentiment": 2, "text": "That did the job! Thanks for that, had me scratching my head for a while.", "human_label_sentiment": 2}
{"id": 57404703, "type": "c", "labeled_sentiment": 2, "text": "@user thanks very much!! :) :)", "human_label_sentiment": 2}
{"id": 57531739, "type": "c", "labeled_sentiment": 0, "text": "Im getting 3 notifications to the same device Even If I deleted the first device token one from my DB…. I didn’t understand still whiz the reason for multiple notifications..", "human_label_sentiment": 0}
{"id": 57515991, "type": "c", "labeled_sentiment": 0, "text": "i dont understand what your question is", "human_label_sentiment": 0}
{"id": 57442865, "type": "c", "labeled_sentiment": 0, "text": "Can you show a sample of what $str looks like after the implode()\nI don't know how to do that since I'm very new to PHP...", "human_label_sentiment": 0}
{"id": 57471874, "type": "c", "labeled_sentiment": 1, "text": "I always store jQuery objects prefixed with a '$', so option 2 with $myElement2. It makes it easier to keep track of.", "human_label_sentiment": 1}
{"id": 80644195, "type": "c", "labeled_sentiment": 2, "text": "Ok thank you Adrian", "human_label_sentiment": 2}
{"id": 70063373, "type": "c", "labeled_sentiment": 0, "text": "The answer you have chosen is technically correct but is misleading. It contains terrible coding practices.", "human_label_sentiment": 0}
{"id": 70035919, "type": "c", "labeled_sentiment": 0, "text": "@user : The stopping criteria is . ie. in first quadrant. Somehow I assumed this information implicit. My bad. Thanks for pointing out.", "human_label_sentiment": 2}
{"id": 70115310, "type": "c", "labeled_sentiment": 0, "text": "edit question and use button to put correct code - now you have incorrect indentions - so it is unreadable.", "human_label_sentiment": 0}
{"id": 41438336, "type": "p", "labeled_sentiment": 2, "text": "I am new to android development , I am trying to connect to my api in android .\nI have developed my api using laravel Framework .\nHere Login.java My api is running in localhost . I am using xampp in windows . Laravel project run on the 8000 port.\nMy code is right as i am able to connect to other api on web .\nI am able to connect to localhost but not able to access the 8000 port .\nI have tried many methods like using 10.10.2.2 , 10.10.2.3 .\nBut getting error Any help appreciated . Please help me , I am trying to do this for 3 days .", "human_label_sentiment": 0}
{"id": 70175372, "type": "c", "labeled_sentiment": 1, "text": "added part of the trace, though cant seem to format correctly", "human_label_sentiment": 1}
{"id": 41492824, "type": "p", "labeled_sentiment": 2, "text": "I am creating custom twig templates for a Drupal 8 theme. I want to render a menu in a region only if the node has a menu link (i.e. when editing the node the menu settings on the right has been configured so the “provide a menu link” box has been checked). Ideally I would like to create this in the twig template so I can change the layout accordingly, but any pointers greatly appreciated!", "human_label_sentiment": 2}
{"id": 70189163, "type": "c", "labeled_sentiment": 2, "text": "@user I don't quite agree with closing, as this is about help with the code -- how to get the appropriate version of it, as it was unclear to me from the repo docs what to use, and the CONTRIBUTING file specifically says to not ask questions in issues. :) I think your first comment would be a fine answer for folks like me to find in the future.", "human_label_sentiment": 2}
{"id": 70197593, "type": "c", "labeled_sentiment": 0, "text": "@user I will go through it, sorry.", "human_label_sentiment": 0}
{"id": 70206119, "type": "c", "labeled_sentiment": 1, "text": "thanks, @user yep, just tried that. I removed all the Search-related code, still no reaction on didSelectRowAt", "human_label_sentiment": 1}
{"id": 42956181, "type": "p", "labeled_sentiment": 1, "text": "You can easily control hidden files writing this in bash_profile Then, reopen your terminal and write hOn. At root folder you will see hidden /usr. Just put it in your finder sidebar. Then write hOff and you will stop seeing the hidden files, but /usr will be always there at finder.", "human_label_sentiment": 1}
{"id": 70159528, "type": "c", "labeled_sentiment": 0, "text": "got down vote with answer, even it is partial, so discouraging", "human_label_sentiment": 0}
{"id": 41519638, "type": "p", "labeled_sentiment": 0, "text": "I'm trying to disable autorotation for a particular view (the first view the user sees) in an ipad app, in the view's .m file i've used the following code: This doesn't however seem to work as the view still rotates to landscape (see screenshot) http Strangely the above code does disable autorotation for 2 other .xib views. Anyone know what I'm doing wrong? As an aside, would this have anything to do with the fact that this is the fist view presented by the app, i.e.: http I've now tried to override the navigation controller method using the below but still no luck, the view still rotates!!! - any ideas?", "human_label_sentiment": 0}
{"id": 64186371, "type": "p", "labeled_sentiment": 1, "text": "This is best variant in security aspect: Create new user on you server then log in.\nRoot is not recommended for running mongo server.", "human_label_sentiment": 1}
{"id": 70158818, "type": "c", "labeled_sentiment": 2, "text": "Don't forget to mark it as an answer if you think it makes sense :)", "human_label_sentiment": 2}
{"id": 70287223, "type": "c", "labeled_sentiment": 2, "text": "Perfect. It worked when I changed \"phase\":[\"phase1\",\"phase2\"] to \"phase\":[\"1\",\"2\"] so you're right. Thanks", "human_label_sentiment": 2}
{"id": 41583127, "type": "p", "labeled_sentiment": 1, "text": "How do I add image to the right side of the table column retaining the Text to the left.\nbelow is the code Table Column Header has \"List\" on the left side, now I want to add images on the other end (Right side end of the table).\nI should be able to add in each row images on the right side of the table cell.", "human_label_sentiment": 1}
{"id": 70401458, "type": "c", "labeled_sentiment": 0, "text": "The only way I can find to make this work involves some really ugly hacks of the text area layout. There doesn't seem to be any other way to get a handle on this.", "human_label_sentiment": 0}
{"id": 70343540, "type": "c", "labeled_sentiment": 0, "text": "I am sorry if this was unclear due to the stuff I just skipped from this entry here, I wanted to keep things as short and context-relevant as possible. \nEnvelopeParser is in fact calling parseResponse from its constructor. In fact, I run this in debug mode with break points, so am 100 % sure there is no local variable contacts, IntelliJ renders the value of the contacts member when breaking at println.", "human_label_sentiment": 0}
{"id": 70423300, "type": "c", "labeled_sentiment": 0, "text": "@user ezloans was supposed to be example domain sorry. I changed  it just now.", "human_label_sentiment": 0}
{"id": 70410830, "type": "c", "labeled_sentiment": 1, "text": "Where's your code?  Please see [Ask].  You also didn't even bother to take the 2-minute site [tour].", "human_label_sentiment": 0}
{"id": 41604317, "type": "p", "labeled_sentiment": 0, "text": "I am using Google Maps API with Angular 2. Everything was working fine until I put the map inside of a modal and now the map won't display. I did some searching and tried invoking the following code once my modal opens: This is giving me the following build error: Cannot find name 'map'. How do I get around this error?", "human_label_sentiment": 1}
{"id": 41594984, "type": "p", "labeled_sentiment": 0, "text": "I wrote a circle to circle collision function but I think I made a little mistake and I can't see to find it.", "human_label_sentiment": 0}
{"id": 70408483, "type": "c", "labeled_sentiment": 2, "text": "You saved my day ! I was looking everywhere but didn't think about that... Thanks !", "human_label_sentiment": 2}
{"id": 70509148, "type": "c", "labeled_sentiment": 0, "text": "Ok, I got it. I guess that this is a problem given that the tcp receive may be broken in several parts, which will then call async_write several times and outputBuffer_ will change during the subsequent calls.", "human_label_sentiment": 1}
{"id": 41652150, "type": "p", "labeled_sentiment": 0, "text": "Can someone please explain me this really weird observation? I've been trying to call Rx extension methods from inside IronPython and it is turning out to be simply impossible. I've boiled it down to this simple example: In this case we start with normal LINQ. If I call the function from my hosting environment with an array or any other object, it works totally fine. So then I tried to simply replace the references to use the extension methods like so: In this case, if I call the function with an object, the call crashes with an ugly error message: Has anyone hit upon something like this? Have I missed something? Is there some special case hack to make work with lambda delegates that is missing? I have to admit I'm completely baffled here. By the way, just as a sanity check, the following example works just fine: I wanted to leave it out there just to make it clear that the problem really is in the method call to .", "human_label_sentiment": 0}
{"id": 41622667, "type": "p", "labeled_sentiment": 2, "text": "What you are looking for is the HTML decode function. MSDN http This will force the browser to interpret the output as HTML rather than as a string. Hope this helps!", "human_label_sentiment": 2}
{"id": 70451134, "type": "c", "labeled_sentiment": 1, "text": "U can find a dozen tutorials everywhere for e.x: w3school", "human_label_sentiment": 1}
{"id": 70532073, "type": "c", "labeled_sentiment": 2, "text": "My pleasure ;-)  no problem. I'm glad it helped", "human_label_sentiment": 2}
{"id": 41641601, "type": "p", "labeled_sentiment": 2, "text": "I have an angular application that is also using jquery.dataTables . When I use datatables to build a dynamic table with the angular directive in the table data, it does not fire the event. I suspect that I need to use the angular service, but I have not been successful finding clear documentation or examples. Any help would be greatly appreciated. UPDATE : I have added some code to the createdRow option in the DataTables method. I seems to be firing now, but I get an error 0x800a01b6 - JavaScript runtime error: Object doesn't support property\n  or method '$apply' Here is my code:", "human_label_sentiment": 2}
{"id": 70507394, "type": "c", "labeled_sentiment": 2, "text": "this works properly, and how to change, span Icon? Thank You", "human_label_sentiment": 2}
{"id": 41669042, "type": "p", "labeled_sentiment": 1, "text": "Just use in the .  I would do:", "human_label_sentiment": 1}
{"id": 70537734, "type": "c", "labeled_sentiment": 0, "text": "Sorry, just edited my previous post. I think there is still enough freeze issues to maintain the post open, I still have to find the best values for bitrate and bufsize, to avoid current issues.", "human_label_sentiment": 0}
{"id": 70665841, "type": "c", "labeled_sentiment": 2, "text": "@user thx I confirm this is working fine, if you can put it in answer I will be glad to accept it", "human_label_sentiment": 2}
{"id": 70560491, "type": "c", "labeled_sentiment": 1, "text": "@user Actually everywhere. Multiple inclusing is the normal case. Thus the guards.", "human_label_sentiment": 1}
{"id": 70653029, "type": "c", "labeled_sentiment": 1, "text": "What's actual value of ? Are you sure you can simply inject an envvar in your yml config? The error appears to be that the string \"${PORT}\" is not an integer, which is true.", "human_label_sentiment": 1}
{"id": 41686174, "type": "p", "labeled_sentiment": 2, "text": "I have the following json which has a product array with product_id as each array.Product ids are numbers. When I am looking online for the pojo classes I am getting Class names which starts with digits which is not allowed. } I have used the http to convert Any help how to create pojo for this JSON is welcome. Thanks in advance.", "human_label_sentiment": 2}
{"id": 118940477, "type": "c", "labeled_sentiment": 0, "text": "Finding this now, it's hilarious, because it makes it impossible to use TPH one-to-one with a primary foreign key, because you end up with multiple primary keys that are 0.  Even assigning by navigation property causes this failure.", "human_label_sentiment": 0}
{"id": 41735738, "type": "p", "labeled_sentiment": 1, "text": "I need to create static layout page in express js using handlebars. Layout will have header (contains username and company logo) and footer (contains copyright info). Hence the layout page should be common for all the pages in the route and only its body content should get change dynamically. I have tried with rendering header and footer as partial view but it displays only in index page and it is not appearing in further pages. Please suggest me to design layout page for express js application", "human_label_sentiment": 1}
{"id": 48055399, "type": "p", "labeled_sentiment": 1, "text": "You are providing entityBuilder.Provider with \"System.Data.SqlClient\" but it should be \"System.Data.EntityClient\" to create connrction string with entity builder as per my knowledge.", "human_label_sentiment": 1}
{"id": 83072272, "type": "c", "labeled_sentiment": 2, "text": "@user correct too, thanks", "human_label_sentiment": 2}
{"id": 83166915, "type": "c", "labeled_sentiment": 2, "text": "First of all, thx for your answer it solved my problem and I have a better understanding of Webflux but some of the wording is confusing me.", "human_label_sentiment": 2}
{"id": 83102296, "type": "c", "labeled_sentiment": 2, "text": "Hi, All. Thanks for the reply and suggestion. Much appreciated :)", "human_label_sentiment": 2}
{"id": 83099199, "type": "c", "labeled_sentiment": 0, "text": "@user existence of this code is one of the reasons why sucks.", "human_label_sentiment": 0}
{"id": 99414633, "type": "c", "labeled_sentiment": 0, "text": "@user I'm facing the same problem, As you said VS cant use files. this mean I can't debug a program that uses files under VS, am I right?", "human_label_sentiment": 1}
{"id": 87524401, "type": "c", "labeled_sentiment": 2, "text": "Welcome to Stack Overflow! Please do not leave signatures under your post, especially links.", "human_label_sentiment": 1}
{"id": 83127468, "type": "c", "labeled_sentiment": 1, "text": "you can also use url wiht instead of to get", "human_label_sentiment": 1}
{"id": 48128941, "type": "p", "labeled_sentiment": 2, "text": "I have a custom field with name and value (case sensitive) as follows: style; rgb(240,180,41) The code to retrieve this is included within the loop on my single.php file: The h2 on the page has a 2px 2px shadow and a 1px outline, but it is not pulling through the custom color as specificied in the 'value' field of the custom field. Any help much appreciated!", "human_label_sentiment": 2}
{"id": 48102738, "type": "p", "labeled_sentiment": 0, "text": "Here in my datatable, I want when we click on application id it should open a new page (formdetails.php) where all the rest of data will be shown. How can we make hyper link of application id? Here is the code for my datatable ( page that index the applications list ). this is on formdetails.php page there is more than 50 fields that needs to be shown, but its not working. i know it is basic and easy to do but i am stucked as i am a beginner.", "human_label_sentiment": 0}
{"id": 48114304, "type": "p", "labeled_sentiment": 2, "text": "I'm using the jQueryUI Autocomplete http widget on my search form, It's working great on my initial search box, the user has the option to add another row using an add button, this fires a function that clones the master search: this adds identifiers to the row, then i'm adding a data-id attribute to the new search box: However when I try and use the appendTo http option on the autocomplete, it doesnt show, If i view the page in the console the list is there but doesnt show, I've tried adding the class to various parts of the page with no luck, any help would be appreciated, here is the function to create the autocomplete: This is called initially on the first search input, and works great: http however when I add another search row. I either get the autocomplete attached to the initial search or it will not show, Any help? Cheers EDIT Here I'm at the point where I'm getting the desired effect, but it is only visible in the console, the user can't see the options? http", "human_label_sentiment": 2}
{"id": 83299970, "type": "c", "labeled_sentiment": 2, "text": "Thank you All for your help. Problem solved. Please see last comment below. Again, thank you All.", "human_label_sentiment": 2}
{"id": 83269195, "type": "c", "labeled_sentiment": 0, "text": "the above json is not valid. was there any change that you made?", "human_label_sentiment": 1}
{"id": 48148246, "type": "p", "labeled_sentiment": 0, "text": "http enter image description here http I want to add multiple files in different directories into the same repository and push it to the remote repository.\nBut I am bit confused can somebody please help me out.", "human_label_sentiment": 0}
{"id": 83268271, "type": "c", "labeled_sentiment": 2, "text": "You’re welcome. And I would appreciate it if you can accept my post by clicking check mark.", "human_label_sentiment": 2}
{"id": 83312640, "type": "c", "labeled_sentiment": 2, "text": "i know :D i dont want that thing to happen, i am so grateful you helped me. thanks a lot!", "human_label_sentiment": 2}
{"id": 48173046, "type": "p", "labeled_sentiment": 1, "text": "My background image is not working using css here is the code: When I run the code the background image is not showing up.\nHow can I fix my and/or so that my background image is working?", "human_label_sentiment": 1}
{"id": 83418703, "type": "c", "labeled_sentiment": 2, "text": "thanks for the comment. i'm definitely trying to do something at the language level, but i'll add this to the list of possible real world solutions!", "human_label_sentiment": 2}
{"id": 83453697, "type": "c", "labeled_sentiment": 1, "text": "You should have posted the console output. It probably would have shown that your variable was not constructed properly", "human_label_sentiment": 1}
{"id": 83444015, "type": "c", "labeled_sentiment": 0, "text": "I have not written a brute force method, as I believe that using an alternative (less accurate) solution to my problem would be preferable. I could write one to post however if you think that would help? I am not a student.", "human_label_sentiment": 0}
{"id": 83478482, "type": "c", "labeled_sentiment": 1, "text": "What did [internet] search results show for \"parsing JSON in Python\"? Surely you're not the only person parsing JSON in Python.. and, once the JSON is parsed, what is the next step? This too (navigating dicts/lists) is probably covered under existing documentation, such as a tutorial.", "human_label_sentiment": 1}
{"id": 83522457, "type": "c", "labeled_sentiment": 0, "text": "@user So sorry, is supposed to be a place holder for the URL string. When I implement the function using it should take the URL from , which is child of each user's information (from the firebase database). I'm basically declaring the type to be referenced as a string from imagePath. This is most likely not the way to go about things?", "human_label_sentiment": 0}
{"id": 83487883, "type": "c", "labeled_sentiment": 1, "text": "Let me go by your comment, is that expected to have consistent model in \"InputStream\"? IMHO, it is just a serious of bytes, and what I make out of it is up to me. Consistent model is maintained through API / Schema contracts not by the term \"stream\"", "human_label_sentiment": 1}
{"id": 83451416, "type": "c", "labeled_sentiment": 2, "text": "@user nope, no reason. I am not very experienced with SVG, so I'm just experimenting with how to accomplish this. If you have a better solution I would love to hear it!", "human_label_sentiment": 2}
{"id": 48233821, "type": "p", "labeled_sentiment": 1, "text": "I note in R if one calls the output is I would like R to give me the first of the month instead. I could supply the whole date, , but am curious why the year-only format imputes the 12th of the month and also to see other solutions.", "human_label_sentiment": 1}
{"id": 48249470, "type": "p", "labeled_sentiment": 0, "text": "I can't seem to figure out Why this happens. I have an Array that I echo as a Json string into a dynamically created JavaScript tag in my page. Here's the PHP code : But when JavaScript is going to Parse the string, I get this Error: SyntaxError: JSON.parse: expected ',' or '}' after property value in\n  object at line 1 column 162 of the JSON data This usually means that I have a Syntax error in my Json string, But I can't find this syntax error. Here is what this script tag looks like in Browser: For the sake of readability, I put a PRETTY_PRINT version of my Json string here: As mentioned in the error, Column 162 of my Json data is the first occurrence of an escaped double quote (\\\"), But it there doesn't seem to be anything wrong with that! Specially when PHP's own function (json_encode) gave me that! What is the problem here? (My browser is Firefox Quantum on Ubuntu Mate 16.04 ...)", "human_label_sentiment": 0}
{"id": 83506180, "type": "c", "labeled_sentiment": 1, "text": "As @user mentioned, use API", "human_label_sentiment": 1}
{"id": 83446777, "type": "c", "labeled_sentiment": 1, "text": "don’t make the helper throw anything, make it return an exception and then throw that form wherever you need to.", "human_label_sentiment": 1}
{"id": 48255435, "type": "p", "labeled_sentiment": 0, "text": "I'm trying to create a function that will return a jsx element wrapped with  and  elements. How to do this? In my code, I have a lot of the following: etc. How can I make a function which takes say as an input parameter and returns a wrapped jsx element? I've tried: I'm afraid I'm still getting used to the syntax and can't figure it out", "human_label_sentiment": 0}
{"id": 83454138, "type": "c", "labeled_sentiment": 0, "text": "Wait I'm confusing. You have \"already been using the library in the project for some time\" and... it just stopped working? Also you should clarify which of these bullet points work and which don't.", "human_label_sentiment": 1}
{"id": 83529269, "type": "c", "labeled_sentiment": 2, "text": "Oops, you're right. I missed the somehow. Carry on!", "human_label_sentiment": 2}
{"id": 48287114, "type": "p", "labeled_sentiment": 0, "text": "I'm using FormulaEvaluator from Apache POI to evaluate 2 cells sum : 10.00 (Cell 1) + 0.80 (Cell 2) = 10.80 This sum in Excel shows 10.80 which is true, but with POI's FormulaEvaluator the result is 10.799999998! This is not working. Why is this wrong with Apache POI and how can I get the formula well evaluated? I'm not looking to round the result because I'm trying to validate every cell on that Excel's two decimals only. Any suggestions?", "human_label_sentiment": 0}
{"id": 83515802, "type": "c", "labeled_sentiment": 0, "text": "Sorry, again that makes no sense. You don't need JS to do that - it's how the HTML control works by default.", "human_label_sentiment": 0}
{"id": 48296727, "type": "p", "labeled_sentiment": 2, "text": "All the best", "human_label_sentiment": 2}
{"id": 48306234, "type": "p", "labeled_sentiment": 0, "text": "I'm implementing the Here Maps navigation SDK in an iOS app. \nWhen I calculate the route before starting navigation, I save the route in an instance variable: . Then when I call the function that stops navigation, the route is removed from the map and is nil. I want to keep the route on the map and go back to itinerary view. This is the solution I came up with but I'd rather not recreate the , it feels hacky...", "human_label_sentiment": 0}
{"id": 48327579, "type": "p", "labeled_sentiment": 0, "text": "After lots of clicking through the Firebase console and the Google Cloud Console, reading SO, asking for help on Slack, and more trial and error than I care to admit, I discovered that the Firebase console has a service account page: http That is different from the service accounts page in the Google Cloud Console http http It turns out you want the Firebase service account, you can not create one via the cloud console. Super, super annoying.", "human_label_sentiment": 0}
{"id": 83672873, "type": "c", "labeled_sentiment": 2, "text": "That makes a lot of sense! Though I can't send params[0][\"id\"] with the API call because slack doesn't take PHP-style array objects (foo[0]), and returns the error \"invalid_array_arg\" instead. I've been trying to figure out how to get around that, which is why I tried stringifying it.", "human_label_sentiment": 2}
{"id": 83673213, "type": "c", "labeled_sentiment": 2, "text": "Thank you Charles!", "human_label_sentiment": 2}
{"id": 83661271, "type": "c", "labeled_sentiment": 0, "text": "My bad, I wrongly referred to the epoch time stamp. So, in simple terms, you want to match and connect the 200 nodes, say, created right now, with all the nodes created since last 24 hours, is that right? Are you matching on all ids (id1, id2, id3, id4) every time you create 200 nodes? If yes, then in a single query or multiple? Did you profiled your query? Share the profile output. Why are you using merge in 3rd part of your query? I believe you will be creating only new relationships every time unless you are matching on more than one id. Also, do give native java API a try, it's much faster", "human_label_sentiment": 0}
{"id": 48310606, "type": "p", "labeled_sentiment": 1, "text": "I have an abstract class (database mapping) implementing an interface where default implementations are injected at runtime (this is part of another library and cannot be changed). I want to override one of the default implementation via a proxy (as that seems like the way to override this). Let's say I want to override tryLoad() method to do my own things instead of what the generated code provides. Given the nature of the library, it is not something I can achieve by simple @user simple way this is currently used is as following: I want to proxy tryLoad() without making changes in all the methods across the whole codebase - that would be to get proxied instance instead of actual one and perform the operation on that. Is there any recommended way to achieve this? Thanks!", "human_label_sentiment": 1}
{"id": 83651536, "type": "c", "labeled_sentiment": 2, "text": "Thanks I'll try it now!", "human_label_sentiment": 2}
{"id": 83730454, "type": "c", "labeled_sentiment": 1, "text": "You can, with yarn aliases. See the third option of this answer .", "human_label_sentiment": 1}
{"id": 83711315, "type": "c", "labeled_sentiment": 0, "text": "@user sorry. This is my first question here.", "human_label_sentiment": 0}
{"id": 83644711, "type": "c", "labeled_sentiment": 0, "text": "On an side note: i found a suboptimal solution, using an interceptor preHandle() to append \"partType\" to the uri and using RequestDispatcher to forward the request with the new uri. This works but i'm worried about the performance hit, cause every request now gets forwarded by the RequestDispatcher.", "human_label_sentiment": 0}
{"id": 94862572, "type": "c", "labeled_sentiment": 1, "text": "I included the 2nd error. I pointed out that I tried to write the method both as 'exists' and 'Exists' (also, as 'exist' and 'Exist') but neither worked. I get the dbSnapshot from an Event Listener that I got from tutorials and it is working fine (in fact, if the node actually exits I can read the data in other parts of the code just fine).", "human_label_sentiment": 1}
{"id": 94905927, "type": "c", "labeled_sentiment": 2, "text": "Yes, agree. This is a very nice approach making it easy to read and adapt. Thank you very much!!!", "human_label_sentiment": 2}
{"id": 54145067, "type": "p", "labeled_sentiment": 2, "text": "When trying to get a NUC7I3BNH installed with Windows Server 2019 not long ago I had some apparent success without having to fiddle around with editing and signing. NOTE: I have not tried this in the Core edition. A workaround might be to get a USB Ethernet Adapter to manage the drivers remotely with MMC or Windows Admin Center (or use the WiFi interface). In the Device Manager, update the drivers for the Ethernet Connection and 'Browse my computer for driver software'. Choose 'Let me pick from a list of available drivers', then selecting the PRO1000/Winx64/NDIS68 folder and selecting any of the .inf files in there. One of the following devices should show up, use one of these: I had downloaded the specific ProSetx64 http drivers for Windows Server 2019, but after than I downloaded the latest Complete Driver Pack http and used the I210 driver. You will be warned about possible problems with the driver, but with some limited use I have not had any issues. I was then able to install the ProSet tools and use the Adaptor Configuration Utility. Hopefully this helps as well.", "human_label_sentiment": 2}
{"id": 94924758, "type": "c", "labeled_sentiment": 1, "text": "You can a memory page in the middle of a large segment.", "human_label_sentiment": 1}
{"id": 54092648, "type": "p", "labeled_sentiment": 1, "text": "The certificate of our website was renewed (with letsencrypt) some days ago without checking for funcionality. Customers now complained about not working website so I checked it again and found out that the site ( http ) is working in IE and edge but not in Firefox or Chrome. In Chrome I get the \"ERR_EMPTY_RESPONSE\" message, Firefox just says (in german:) Starting the same server with apache2 works fine but we need lighttpd for internal purposes. SSL checker ( http ) states everything ok. lighttpd must only display a pure HTML page for testing... lighttpd -v command shows: Also the OS is update2date. Are there any tips how we can fix this issue? Any ideas why? Browser cache was cleared and connectiong from mobile phone did also not work...", "human_label_sentiment": 0}
{"id": 54050644, "type": "p", "labeled_sentiment": 1, "text": "Yes. You need to iterate through the vector and http the contents to the output stream with the help of std::ostream_iterator http . See live http", "human_label_sentiment": 1}
{"id": 95006826, "type": "c", "labeled_sentiment": 0, "text": "I really do ask myself why you ever want that? You already own the variable, why do you need a reference to it? You can get it for free, you don't have to waste 8bytes for that.", "human_label_sentiment": 0}
{"id": 95005961, "type": "c", "labeled_sentiment": 1, "text": "Protractor will (and should) exit with error code 1 when a test fails.", "human_label_sentiment": 1}
{"id": 54100525, "type": "p", "labeled_sentiment": 0, "text": "So I have the User, Admin and Dev role, yet I can't see the area for Admin and Dev?..", "human_label_sentiment": 0}
{"id": 54131066, "type": "p", "labeled_sentiment": 0, "text": "Is there a lightweight GCC distribution that I can install in Alpine? I am trying to make a small Docker image. For that reason, I am using Alpine as the base image (5MB). The standard GCC install dwarfs this in comparison (>100MB). So is there a lightweight GCC distribution that I can install on Alpine? Note: Clang is much worse (475MB last I checked).", "human_label_sentiment": 0}
{"id": 54128589, "type": "p", "labeled_sentiment": 1, "text": "It is possible, see this http stackblitz. I don't think your problem lies in your CSS, more likely you are not setting the of your table container to more than one column. Can you show the template code of your expanded detail row where the nested table is located? From the Angular Material documentation http , check the code of the table with expandable rows.", "human_label_sentiment": 1}
{"id": 54160012, "type": "p", "labeled_sentiment": 2, "text": "This is a simple way to do it. But not the smartest way. The html will look like this , You can change this to your HTML code Hope this helps.", "human_label_sentiment": 2}
{"id": 95190147, "type": "c", "labeled_sentiment": 0, "text": "@user No sir! It is absolutely valid to use more than one popup in a same stage. Because in this case, It would be so ridiculous to make 10-12 stages only because I want to use these many Popups.", "human_label_sentiment": 0}
{"id": 95137211, "type": "c", "labeled_sentiment": 1, "text": "DatasetID, EmbedUrl, WebUrl, Id,Name are the available properties of a report object. Here reportname is available, but I need to reach the pages and get the names of the each page of the report. @user", "human_label_sentiment": 1}
{"id": 95146207, "type": "c", "labeled_sentiment": 0, "text": "http - The above is from this url. So yes, unset triggers the __destruct. So this is actually the __destruct that deletes an object. Probably not... So I still dont quite get what it means. Like if there is no __destruct (as it does not have to be there) the unset() will still delete it, right? So what is the difference here?", "human_label_sentiment": 0}
{"id": 54184970, "type": "p", "labeled_sentiment": 1, "text": "(Answered myself since nobody from the comments did in two days, thanks to G.M http for all the help) The problem is in the order of initialization of the variables. Having declared before anything else causes problems. To fix, I just had to change this: To this:", "human_label_sentiment": 1}
{"id": 95191882, "type": "c", "labeled_sentiment": 0, "text": "had been stuck with this for a week!", "human_label_sentiment": 0}
{"id": 95092201, "type": "c", "labeled_sentiment": 1, "text": "Give those elements a class that your click handler can check for.", "human_label_sentiment": 1}
{"id": 54209986, "type": "p", "labeled_sentiment": 1, "text": "How do I print only the part? This value is stored in the variable.", "human_label_sentiment": 1}
{"id": 54179582, "type": "p", "labeled_sentiment": 0, "text": "By using primeng, when i click right click in a tree node Contextmenu do not open.\nInitial code :- and in component.ts where import in component.ts is :- and in module Whats wrong i'm doing?", "human_label_sentiment": 0}
{"id": 95273175, "type": "c", "labeled_sentiment": 1, "text": "You are encourage to use the syntax to be clear that you are using a trait object.", "human_label_sentiment": 1}
{"id": 95251701, "type": "c", "labeled_sentiment": 2, "text": "@user thanks for edit: I forgot to write in front of .", "human_label_sentiment": 2}
{"id": 100462132, "type": "c", "labeled_sentiment": 0, "text": "delete a question with answer is not very good", "human_label_sentiment": 0}
{"id": 54245613, "type": "p", "labeled_sentiment": 1, "text": "I'm wondering what the best way to approach this problem is and I'm very new to TypeScript and Angular. Using Angular 5. Anyway. I have a list of elements on a page via a table. http This is the code that controls said list. What I'm aiming to do is that if a user clicks on the pencil(edit) icon, then the adjacent div changes from just a regular td to an input and the edit/delete buttons to change to a cancelEdit/save edits button group. (I know that I need to change the html a bit because the buttons aren't in the form element currently, but I'm not there on the wiring it up part). I've thought of two ways to do this. 1) with ngIf's so that I can conserve the elements that are rendered and the edit/cancel buttons toggle the editMode; or 2) use ngClass and toggle display:none css classes for the button clicked. Right now, when you click the edit button, regardless of which edit button you click, it flips all the columns to inputs, rather than just the row the user wants to edit. http Here's my component ts: Any thoughts on the best (most efficient) way to make this happen?", "human_label_sentiment": 1}
{"id": 54270256, "type": "p", "labeled_sentiment": 0, "text": "I am working to install apache-ignite C++ I followed up installation guide, but didn't work. I think this has an error Detail Capture http", "human_label_sentiment": 0}
{"id": 95355707, "type": "c", "labeled_sentiment": 1, "text": "The code and layouts are the important things, and those should be posted as text. If you'd like to include a screenshot to better illustrate your description, then you can upload one or two here, I believe, but they will just show as links, which is fine.", "human_label_sentiment": 1}
{"id": 54285571, "type": "p", "labeled_sentiment": 1, "text": "Input type must accept only: letters(a-z and A-Z) Numbers(only positive integers) No Special Characters", "human_label_sentiment": 1}
{"id": 54424436, "type": "p", "labeled_sentiment": 2, "text": "Well, looks like I mostly found the answer, but it has some caveats anyway. I used the Keycloak OpenID Connect setup with SSSD federation, because LDAP is the wrong approach for my goals anyway. More about that setup you can read here http , I faced some stupid moments over there, most of them are predicted and bypassed in this http guide, but that's more a FreeIPA + Keycloak thread. Last Keycloak thing that should be noted: I had to add and allow HBAC \"keycloak\" service to make it work, because otherwise my SSSD authentication was denied. Going forward to the .NET Core part: my app is 2.1, and my setup looks like that: I added the following into Startup.cs dependencies: Next, I added the configuration to appsettings.json Okay, heading to the configuration itself: I hope this short answer will help someone to set up FreeIPA+Keycloak and connect it to .NET Core, because I killed a week for this :D.", "human_label_sentiment": 2}
{"id": 54291513, "type": "p", "labeled_sentiment": 2, "text": "I'm new with kivy. I've recently made the first simple applications. From the various online documentation I noticed that there is a command that always varies according to the interpretation of the developers. I'll give a simple example: kv sample file: I wonder... regardless of the fact that the name of the ShowApp class must be equal to in the kv file, which parameter must be passed to that class that takes care of generating all the layout that is included in the kv file? In my example I called it thisParameterWillCompletelyChangeYourLife , and it is precisely with regard to this input that I did not understand the will of the documents about kivy read so far. Can someone explain to me what parameter should be passed (and what is it for) to the function that generates the 'app' in the building phase? Many thanks in advance!", "human_label_sentiment": 2}
{"id": 54300177, "type": "p", "labeled_sentiment": 2, "text": "I admittedly am an extreme C++ novice, so please forgive me for my probably very naive question. I am writing code that should parse an assembly language file in its fundamental parts, to be translated into machine language at a second stage. I have built a class, but I am not having success in opening the external assembly textfile, and in feeding it to the various functions that compose my class. More in particular, there are problems with the constructor.\nI attach the full code I wrote below: I provide the name of the textfile to be opened, from the command line ( file located in the same folder of this file). Hence I need to use which I suppose may be part of the problem. When I try to build this, visual studio 2008 gives me the following 2 errors: 1 error C2512 : 'std::basic_istream<_Elem,_Traits>' : no appropriate default constructor available line 21 2 error C2059 : syntax error : ']' line 137 Help appreciated, and insults tolerated, thanks :)", "human_label_sentiment": 2}
{"id": 76953106, "type": "p", "labeled_sentiment": 1, "text": "I have attached two images; one is the actual control image (radio button), and a graphic explanation of the Path/Data. http", "human_label_sentiment": 1}
{"id": 95375798, "type": "c", "labeled_sentiment": 0, "text": "dear friend .don't worke me ,this way", "human_label_sentiment": 0}
{"id": 105341650, "type": "c", "labeled_sentiment": 1, "text": "@user Use in the last line.", "human_label_sentiment": 1}
{"id": 59579198, "type": "p", "labeled_sentiment": 1, "text": "You need to wrap UIActivityIndicator and make it UIViewRepresentable. Then you can use it as follows – here’s an example of a loading overlay. Note: I prefer using ZStack, rather than overlay(:_), so I know exactly what’s \n   going on in my implementation\nstruct LoadingView: View where Content: View {", "human_label_sentiment": 1}
{"id": 105395261, "type": "c", "labeled_sentiment": 2, "text": "Thanks, this works! But is there a way to read that first category (.head(1).index) as part of an aggregation that could be used with .agg? The reason I was thinking of doing it in some function form was so that I could ultimately do something like .agg('Placement' : 'getHighestPlacement', 'end_date':'max') as I have another column I need to aggregate to get the max date.", "human_label_sentiment": 2}
{"id": 105358252, "type": "c", "labeled_sentiment": 0, "text": "@user Using a vector for this isn't all that sensible", "human_label_sentiment": 0}
{"id": 105408963, "type": "c", "labeled_sentiment": 2, "text": "Thank you for your explanation and example code! Would it be possible to get the content of without for loop or adding each value to seperately? I tried casting the array like: , but it doesn't work.", "human_label_sentiment": 2}
{"id": 105331587, "type": "c", "labeled_sentiment": 0, "text": "This is hard to answer without knowing the details of your protocol. Do the successful clients disconnect?", "human_label_sentiment": 0}
{"id": 105500443, "type": "c", "labeled_sentiment": 1, "text": "No, it still shows the same error. feign.FeignException: status 400 reading UploadServiceClient#upload(String,MultipartFile); content:\n{\"timestamp\":\"2020-01-09T19:21:20+0000\",\"status\":400,\"error\":\"Bad Request\",\"message\":\"Required request part 'file' is not present\",\"path\":\"/upload\"}", "human_label_sentiment": 1}
{"id": 105425613, "type": "c", "labeled_sentiment": 1, "text": "Use for PyTorch", "human_label_sentiment": 1}
{"id": 105424412, "type": "c", "labeled_sentiment": 2, "text": "Oh... I see. Indeed it is an interesting problem... Maybe there is a way, I will keep the eyes on this thread to see if someone can make it. If there is a way, I am really willing to know.", "human_label_sentiment": 1}
{"id": 59607838, "type": "p", "labeled_sentiment": 2, "text": "I'm currently trying to make ps1 script that creates another ps1 script via echo, add-content, clip and so forth. What I'm trying to do is write a ps1 script that gets a folder, stores it in a variable ( ) and writes the new ps1 to a file in that folder to afterwards run it from that folder. Here's my code so far: The final product (KickStart.ps1) should look like this: Instead my current scripts generates this: I seriously don't know what I'm doing wrong, I've put in almost 12 hours finding the solutions, help would be appreciated.", "human_label_sentiment": 0}
{"id": 59664441, "type": "p", "labeled_sentiment": 2, "text": "I have a type in swift with an init method that accepts the json that's being called from code I don't control. Can I use this to automatically deserialise that object? Is something like this possible? Codable has auto implemented encode/decode for me and I would like to use it :)", "human_label_sentiment": 1}
{"id": 121547866, "type": "c", "labeled_sentiment": 1, "text": "I think this should be the accepted answer, it has a link of the commit that introduced the change and provides a solution on how to make it work after the change was introduced.", "human_label_sentiment": 1}
{"id": 59628931, "type": "p", "labeled_sentiment": 1, "text": "Please, find my data below. I have produced this Forest Plot, and I would like the encircled text to be red instead of black. Can this be done? http My script My data", "human_label_sentiment": 1}
{"id": 105455435, "type": "c", "labeled_sentiment": 0, "text": "If you also need to truncate then it's a string, not a number, and it's a trivial regex--how is that any less simple?", "human_label_sentiment": 0}
{"id": 105925392, "type": "c", "labeled_sentiment": 1, "text": "I tried with 'Countie_a' as well. No luck. I don't think the issue is with the key. I have a feeling it is to do with the order or the elements in the file when comparing the two json files", "human_label_sentiment": 1}
{"id": 59719098, "type": "p", "labeled_sentiment": 0, "text": "I'm fairly new to SQL, struggling with this one. I have a big table and i'm trying to count how many Shapes each Name has and how many Size Shapes each Name Has. I want the results to look like this Sorry if this isn't how this should be laid out - trying to automate some reports i'd otherwise have to manually do monthly. Thanks\nMatt", "human_label_sentiment": 0}
{"id": 59692647, "type": "p", "labeled_sentiment": 0, "text": "I'm trying to mimic other mobile chatting apps where when you select the textbox and it opens the virtual keyboard, the bottom-most message is still in view. There doesn't seem to be a way to do this with CSS amazingly, so JavaScript (only way to find out when the keyboard is opened and closed apparently) events and manual scrolling to the rescue. Someone provided this solution http and I found out this solution http , which both seem to work. Except in one case. For some reason, if you are within (250 pixels in my case) pixels of the bottom of the messages div, when you close the mobile keyboard, something strange happens. With the former solution, it scrolls to the bottom. And with the latter solution, it instead scrolls up pixels from the bottom. If you are scrolled above this height, both solutions provided above work flawlessly. It's only when you are near the bottom that they have this minor issue. I thought maybe it was just my program causing this with some weird stray code, but no, I even reproduced a fiddle and it has this exact issue. My apologies for making this so difficult to debug, but if you go to http (the show suffix provides a full-screen mode) on your phone, you should be able to see the same behavior. That behavior being, if you scroll up enough, opening and closing the keyboard maintains the position. However, if you close the keyboard within pixels of the bottom, you'll find that it scrolls to the bottom instead. What is causing this? Code reproduction here:", "human_label_sentiment": 0}
{"id": 105612256, "type": "c", "labeled_sentiment": 0, "text": "@user sorry fixed.", "human_label_sentiment": 0}
{"id": 105643400, "type": "c", "labeled_sentiment": 2, "text": "I'll remember this throughout my career. Thank you Sir. I appreciate this.", "human_label_sentiment": 2}
{"id": 105677858, "type": "c", "labeled_sentiment": 2, "text": "@user Glad to hear that. You can accept my solution as answer. Thank you!", "human_label_sentiment": 2}
{"id": 105701978, "type": "c", "labeled_sentiment": 2, "text": "Sure, but it identifies a representative location that has a specific set of timezone offset rules and history for a place or administrative area within a timezone, it's not a timezone identifier per se . :-)", "human_label_sentiment": 2}
{"id": 107062655, "type": "c", "labeled_sentiment": 0, "text": "Timothy, sorry about this delayed reply. Yes, it is working on the new documents but for some reasons it is not working on the existing template that I am trying to restrict users from adding new styles to.", "human_label_sentiment": 1}
{"id": 105665970, "type": "c", "labeled_sentiment": 0, "text": "Sorry, I see that when the fixture is in the test file, it runs, outputs my debug line, and says 'errors on teardown', which is fine. But the errors don't appear unless I put in the fixture. Printing caplog.records returns , even though the critical log result does show up in the (intentionally failed) test output. If the fixture is in , nothing prints and no errors are shown.", "human_label_sentiment": 0}
{"id": 105651904, "type": "c", "labeled_sentiment": 1, "text": "Better to make a set rather than a list, for efficient membership tests.", "human_label_sentiment": 1}
{"id": 59744589, "type": "p", "labeled_sentiment": 2, "text": "As the question says, I have a series of strings like . How can I convert this series to using Python? I prefer the method on pandas. If not is there any method to solve this task? Thank all.", "human_label_sentiment": 2}
{"id": 105662837, "type": "c", "labeled_sentiment": 2, "text": "aaaaaaaaah damn hahahhah yeah I've literally assigned the for loop to that geez, thanks!", "human_label_sentiment": 2}
{"id": 105709207, "type": "c", "labeled_sentiment": 2, "text": "Thank you for helping me :)  I understand this code is working now", "human_label_sentiment": 2}
{"id": 59769786, "type": "p", "labeled_sentiment": 2, "text": "I'm creating a REST web service with Spring, but I'm getting a internal server error and don't understand why.\nI have a List of DoenteIdentidade's, this is the structure of the DoenteIdentidade As you can see there is a object inside called Doente, what I'm trying to do is extract all the Doente objects contained inside all the DoenteIdentidade of this list to a List of Doente's. Here is a snippet of the code I wrote for this goal, for some reason I'm getting a internal server error when I try to add to the List of Doente's. Any help is very welcomed.", "human_label_sentiment": 2}
{"id": 105643221, "type": "c", "labeled_sentiment": 2, "text": "@user Thanks so much, that solve my problem. :')", "human_label_sentiment": 2}
{"id": 105808534, "type": "c", "labeled_sentiment": 2, "text": "Awesome thanks! I was under the impression C > 1 but this makes a lot more sense. Thanks!", "human_label_sentiment": 2}
{"id": 105778571, "type": "c", "labeled_sentiment": 1, "text": "This \"127.0.0.1:8000/cart/\" does not match any of your url. Please check, you have three urls, a blank (\"\"), cart/ and remove/ . 2) Nmae for 1st two urls are same.", "human_label_sentiment": 1}
{"id": 105931426, "type": "c", "labeled_sentiment": 2, "text": "@user thanks for you suggestion! I will have a chance to try during the next few days", "human_label_sentiment": 2}
{"id": 105818003, "type": "c", "labeled_sentiment": 1, "text": "you need to ship the whole folder instead of just the .py file this will avoid the error of missing .exe", "human_label_sentiment": 1}
{"id": 105814331, "type": "c", "labeled_sentiment": 0, "text": "Cause it makes no sense initializing an object to a , meaning it can't be changed and having it have uninitialized values, there is no use for this sort of code and that is why it is forbidden. When you use the keyword - it means that the value can be later changed, so the code can be used in a predictable manner.", "human_label_sentiment": 0}
{"id": 105869449, "type": "c", "labeled_sentiment": 0, "text": "Sorry, should have read your comment closer. Yes, if you're seeing an \"Answer your own question\" checkbox, go that route.", "human_label_sentiment": 0}
{"id": 105929421, "type": "c", "labeled_sentiment": 2, "text": "Thanks for notification, i forgot to write the but it is in my function", "human_label_sentiment": 2}
{"id": 105871970, "type": "c", "labeled_sentiment": 1, "text": "It used to be a simple send command, but when I tried to figure out how to do a specific send, it was said that you had to store the user id to be able to use it via a send command. specific and that's what I tried to do with the manipulations you mentioned. lookup.push(op.id) was to store the id\nlookup[i].send(JSON.stringify(res.rows)) was to send to specific ID", "human_label_sentiment": 1}
{"id": 105886003, "type": "c", "labeled_sentiment": 1, "text": "See new version of function.", "human_label_sentiment": 1}
{"id": 105857341, "type": "c", "labeled_sentiment": 0, "text": "I still can't see how you are calling this function.", "human_label_sentiment": 0}
{"id": 65562494, "type": "p", "labeled_sentiment": 2, "text": "I am creating a python program which scrapes company financials off a website. I am aware that websites which contain this information makes it particularly difficult to scrape data reliably, and as such, I have met a roadblock. http From this website, I am attempting to scrape the value next to the text \"Return on Equity (TTM)\". (currently it's 8.86) I have searched StackOverflow and plenty of other sites. The closest I have got is this: However, this creates the error: The line which creates the \"spans\" variable does not create an error when you remove the find_next bit on the end, instead it prints I have seen other people successfully use a similar line of code. However, seeing as I am a beginner with BeautifulSoup, there is still clearly a concept I have not grasped. If anyone could guide me in the right direction, I would be very grateful.", "human_label_sentiment": 1}
{"id": 65548764, "type": "p", "labeled_sentiment": 1, "text": "I just started learning python, and tried my hands on creating a discord bot. Here is a code snippet: Output: Image of the bot output http How can I crop the image and then embed it? I tried saving the image from url then crop it using PIL, but it was a lengthy process. Is there any other way to do it?", "human_label_sentiment": 1}
{"id": 115966603, "type": "c", "labeled_sentiment": 1, "text": "What language are you using? Assuming you are using NodeJS and dialogflow-fulfillment , you can use getContext() method to get an output context.", "human_label_sentiment": 1}
{"id": 115928379, "type": "c", "labeled_sentiment": 2, "text": "Or for the other direction :)", "human_label_sentiment": 2}
{"id": 115994463, "type": "c", "labeled_sentiment": 0, "text": "I can't Help anymore I need to see the big picture", "human_label_sentiment": 0}
{"id": 116054505, "type": "c", "labeled_sentiment": 1, "text": "If I am not using   \"/filteredimage/:image_url\"` or \"/filteredimage?image_url= then will be able to get input image url.", "human_label_sentiment": 1}
{"id": 116028739, "type": "c", "labeled_sentiment": 0, "text": "It's already enabled but still that error comes up :(", "human_label_sentiment": 0}
{"id": 116081888, "type": "c", "labeled_sentiment": 0, "text": "@user I have written my code over and over and I feel I'm in the wrong direction. I didn't share it because I think it will confuse you about what my goal is.", "human_label_sentiment": 0}
{"id": 116117833, "type": "c", "labeled_sentiment": 1, "text": "Thank @user I am not even sure how I would go about finding out if they are supported or not. I have tried raising a github issue and a discussion forum post but received no replies. Today I am trying the slack channel.", "human_label_sentiment": 1}
{"id": 65671571, "type": "p", "labeled_sentiment": 2, "text": "Actually I developed an workflow for Alfred. It suppose whatever you search to open in a new private window in Safari, and it work as it supposed.. but the problem is, it open every search in a new private window, and I want the first search to open a new private window, and start with the next one, just to open new tabs inside that window. Hope I was clear enough, I am kinda new, and I do my best to learn, so any suggestion are very welcomed. Here is what I got so far: P.S The part 2 of the code, is just my draft, technically that part open a new tab inside the window, but is just a duplicate of the initial search.", "human_label_sentiment": 2}
{"id": 65640776, "type": "p", "labeled_sentiment": 2, "text": "I'm new to shell scripting and was reading online how shell scripts could be written. I made this following script but it doesn't seem to work, but when I type this command directly in the terminal window then it works. Can someone please tell me why this is not working. Thanks in advance.. Following is my script code But when I type directly in the Terminal then it works correctly and generates the output in the /tmp/histDelTemp file.", "human_label_sentiment": 2}
{"id": 116028532, "type": "c", "labeled_sentiment": 0, "text": "No, I really want all NaN values removed completely from my tables, so that I only have the non-NaN values left for each specific column. This is because the NaN values are to many, and therefore affect my plotted graphs and ML training algorithms in a bad way.", "human_label_sentiment": 0}
{"id": 116107496, "type": "c", "labeled_sentiment": 0, "text": "@user I have to disagree with your edit. What makes you think he/she want to specifically simplfiy the if's?@Beginner12345 makes no mention about this in his question text. In my opinion he/she would need to clarify that first.", "human_label_sentiment": 0}
{"id": 65665932, "type": "p", "labeled_sentiment": 1, "text": "I have a component like below My file is like below But I am getting empty array.", "human_label_sentiment": 1}
{"id": 116130968, "type": "c", "labeled_sentiment": 0, "text": "Actually, I just noticed that my alternative code won't work, although it looks similar. The while loop should terminate when the fork call returns zero, because it's the child process and you don't want child processes creating sub-processes. It's an odd piece of code that can trip people up easily. Also, it's not very good about handling errors and the parent process doesn't keep a record of the processes it's created so cleaning up could be an issue.", "human_label_sentiment": 1}
{"id": 116126769, "type": "c", "labeled_sentiment": 0, "text": "@user sorry, dont understand your question. Tensorflow normally working with multidimensional arrays", "human_label_sentiment": 0}
{"id": 65696356, "type": "p", "labeled_sentiment": 1, "text": "I have many files in folder , i want to copy files from folder to other folder if file name is available in list .", "human_label_sentiment": 1}
{"id": 116136267, "type": "c", "labeled_sentiment": 2, "text": "Awesome, I can work with this.", "human_label_sentiment": 2}
{"id": 116188297, "type": "c", "labeled_sentiment": 1, "text": "From dba.stackexchange.com How to partition existing table in postgres? The accepted answer shows creating a new partitioned table, copying the data to the new table then swapping the tables by renaming them . The last part just changes metadata so the downtime is minimal. With Pg. 10+'s partitioning there's no need for inheritance or triggers though.", "human_label_sentiment": 1}
{"id": 116199407, "type": "c", "labeled_sentiment": 2, "text": "That is way more elegant than what I was trying to do. Thank you! One correction though - You did it correctly in your code, but in your explanation in your parentheses, it's \"Destination\" from df1 and \"Source\" from df2.", "human_label_sentiment": 2}
{"id": 116134535, "type": "c", "labeled_sentiment": 1, "text": "@user I've tried querying the history object of React Router as another method but have had no luck with that. My idea was to keep a list of the paths that have been accessed by the user in an array and programmatically render them in the side nav if they are in history but whilst I can see a count of pages accessed I couldn't retain the pathnames.", "human_label_sentiment": 1}
{"id": 65688253, "type": "p", "labeled_sentiment": 1, "text": "I am getting the following System.BadImageFormatException: 'Could not load file or assembly\n'Flir.Atlas.Live, Version=2.0.14266.1000, Culture=neutral,\nPublicKeyToken=caa391fd8e07c76b' or one of its dependencies. An\nattempt was made to load a program with an incorrect format.' I do have Flir.Atlas.Live referenced and the Version shows incorrectly as \"2.0.14266.1000\" in the reference properties. http When I go to the actual file I referenced at the path the version of that file is \"6.0.18050.1001\". When I check the dll file that is actually being copied to the bin/debug folder it is also version \"6.0.18050.1001\". It is like there is a requirement somewhere that specifies version \"2.0.14266.1000\". I cannot find that version number anywhere in my solution when I search for it. If I delete Flir.Atlas.Live\" as a reference and readd it I get the same result. What could be causing the version mismatch? EDIT - This is 64 bit. It was 32bit, I am compiling for 64 bit only. EDIT 2 - .csproj file has old version requirements:", "human_label_sentiment": 1}
{"id": 116207264, "type": "c", "labeled_sentiment": 0, "text": "Also @user be aware it is really , really tricky to use messaging (which is continuous) in a frame-based game engine.  If you really are going to try YOURSELF tyo write from scratch with net sockets, here:  http", "human_label_sentiment": 0}
{"id": 116200174, "type": "c", "labeled_sentiment": 2, "text": "@user - thanks for pointing this out, so table_b_id should actually be int? I just kept it the same type as what was in table_b for column id", "human_label_sentiment": 2}
{"id": 116664598, "type": "c", "labeled_sentiment": 1, "text": "You're always overriding the Sheet that the Iterator provides you with the Sheet at index zero. Remove \"Sheet = workbook.getSheetAt(0)\" and let only \"Sheet sheet = Sheet Iterator.next()\" defining your Sheet.", "human_label_sentiment": 1}
{"id": 116306244, "type": "c", "labeled_sentiment": 2, "text": "I changed my code to the following to solve the issue. Thank you for the help...", "human_label_sentiment": 2}
{"id": 65782408, "type": "p", "labeled_sentiment": 1, "text": "I have tried a few things including changing JDK_HOME to the current JDK, removing all jdk and installing jdk8, and reinstalling android studio, but the same issue persists. I have used the program before and it was working a few days ago", "human_label_sentiment": 1}
{"id": 65816233, "type": "p", "labeled_sentiment": 0, "text": "In documentation http says that readExternal() and writeExternal() have default access modifier and I also implement it with default access modifier, but somehow I have 2 error which says that I assign weaker access modifier? So why is that? (I know that using default modifier I can not serializa/deserialize objects from other package) Error1: Error:(19, 10) java: readExternal(java.io.ObjectInput) in A cannot\nimplement readExternal(java.io.ObjectInput) in java.io.Externalizable\nattempting to assign weaker access privileges; was public Error2: Error:(16, 10) java: writeExternal(java.io.ObjectOutput) in A cannot\nimplement writeExternal(java.io.ObjectOutput) in\njava.io.Externalizable   attempting to assign weaker access\nprivileges; was public", "human_label_sentiment": 0}
{"id": 116466339, "type": "c", "labeled_sentiment": 0, "text": "Sorry, I'm missing something here.  Do I have to create a new file monoidNonEmpty.hs?  My current code is in the file Testing.hs.  So, I'll have to include in my Testing.hs?  How do I redefine monoidP?  Do I need to update my Cabal file?", "human_label_sentiment": 0}
{"id": 65877053, "type": "p", "labeled_sentiment": 2, "text": "OK, you could try to use Linear Congruential Generator http , which has some interesting properties - with good choice of constants it will cover whole range [0...2 n ) once without repetition before it hits its period. Thus, it is basically equivalent to sampling without replacement. Code for n=64, if you need exactly 63, I could dig out set of constant, just ask. Python 3.9.1, Win10 x64", "human_label_sentiment": 2}
{"id": 70553016, "type": "p", "labeled_sentiment": 0, "text": "The error means that as you are iterating through the using the you are also modifying it at the same time by adding new elements and this is not correct. You can have another local variable of type just in the fromJson and in the forEach block just add the new elements to this local variable and use it in the return instead of the .", "human_label_sentiment": 1}
{"id": 124780431, "type": "c", "labeled_sentiment": 0, "text": "Even after adding those, I'm getting the error", "human_label_sentiment": 0}
{"id": 124787585, "type": "c", "labeled_sentiment": 0, "text": "The nearest 0.05 to 11.10 being 11.05 seems misleading to me, is that intentional? Surely 11.10 is closer to... 11.10", "human_label_sentiment": 0}
{"id": 70599640, "type": "p", "labeled_sentiment": 0, "text": "I'm trying to install wholebrain by Daniel Fürth, following the instructions on the macosX install page ( available here http ). I am running MacOS Big Sur 11.5.2, R 4.1.2, and RStudio 2021.09.1. Unfortunately, the program is not straight-forward to install and requires significant developer tools to work correctly. I'm not a programmer and have almost no experience with coding, so I've been mucking through the instructions for two days now trying to get the install to work correctly and I'm firmly stuck on the final step. In RS, when I run, I get the following error message: I have been trying to figure out what this means for quite awhile now and I think I've narrowed it down to R is not reading the location of the fftw header file from where it was installed by Homebrew. (I could be totally wrong, again- not a programmer) From what I understand, Homebrew always installs under opt/homebrew/cellar. And, in fact, in there is the compiled fftw program with the needed \"fftw3.h\" file. But for some reason, RStudio is not able to find and read the file in that location. From random googling and reading of other posted issues, I think that RStudio may expect the file to be under usr/local/include. Can I just copy and paste the header file into that folder? Or will I be screwing something up if I do that? I am totally intimidated by fftw's description of manual compilation so I don't really want to attempt that. Is there a way to change where R is looking for that header file? I already set my wd to \"/\" so shouldn't R be able to access any folder on my computer?", "human_label_sentiment": 0}
{"id": 124773334, "type": "c", "labeled_sentiment": 2, "text": "That worked; I didn't realise you could provide aliases for tables in a JOIN statement. Thanks!", "human_label_sentiment": 2}
{"id": 124790603, "type": "c", "labeled_sentiment": 2, "text": "Thanks, I hadn't seen the update. (I am a total newbie here). Thanks a lot. It helped me a lot <3", "human_label_sentiment": 2}
{"id": 70605736, "type": "p", "labeled_sentiment": 2, "text": "I'm trying to use Numba to accelerate some functions, in particular a function that performs a 3D rotation given three angles, as shown below: The function is relatively simple, but when Numba calls it, it throws an error when I try to define .It appears that Numba has a problem with multidimensional arrays (?).  I'm not sure how to modify this such that Numba could utilize it.  Any help would be appreciated.", "human_label_sentiment": 2}
{"id": 124806748, "type": "c", "labeled_sentiment": 1, "text": "actually I don't recommend the internal API for this as it will change. the right way is to use : http", "human_label_sentiment": 1}
{"id": 124902324, "type": "c", "labeled_sentiment": 1, "text": "@user I have updated the answer so that it prints all results obtained until the recording is stopped.", "human_label_sentiment": 1}
{"id": 124941826, "type": "c", "labeled_sentiment": 1, "text": "@user Is this a WinForms application or something else? Your code worked as expected for me on both .NET Framework and .NET 6.0.", "human_label_sentiment": 1}
{"id": 124927430, "type": "c", "labeled_sentiment": 2, "text": "Thanks for your reply. I had already played around with the lambda function (also works with a neat min() and max() function. However, I struggled with applying it to specific sections / rows of my list as required.", "human_label_sentiment": 2}
{"id": 70667692, "type": "p", "labeled_sentiment": 1, "text": "I'm absolutely new to all this ci/cd thing and its documentation is too extensive. So i'd like to apologize in advance if there is too easy question. I have gitlab repo with many configs for different services i.e: I'd like to know what should I do (just general plan and some key words to search documentation more precisely already would be fine) to send to hosts [host1:port, host2:port, host3:port] different strings with commands \"check {service_name} for changes\" or \"check {global_config} for changes\" e.t.c, depending on the file that was committed. I already have my service on each host that could perform different operations for different task's strings, so I need just send them that task.", "human_label_sentiment": 1}
{"id": 70690430, "type": "p", "labeled_sentiment": 2, "text": "I'm currently creating the login functionality of a java web application just using java and JDBC. What built in java libraries are there to make the authentication process easier. I am able to query my PostgreSQL database and retrieve user information such as their password and username but I do not want to store it in plain text.Any tips would be great and o yeah I'm not using spring, which I see there is plenty for.", "human_label_sentiment": 2}
{"id": 70699912, "type": "p", "labeled_sentiment": 2, "text": "I will also add an answer in dplyr, which is great for filtering etc.", "human_label_sentiment": 1}
{"id": 124986334, "type": "c", "labeled_sentiment": 0, "text": "I do not have a good solution.... Can you try some ? My guess is that you have multiple encoding ...", "human_label_sentiment": 0}
{"id": 125070078, "type": "c", "labeled_sentiment": 0, "text": "Does shuffling slow down your code ? I can’t imagine that it is so inefficient.", "human_label_sentiment": 0}
{"id": 124982764, "type": "c", "labeled_sentiment": 0, "text": "Side note: please try to avoid using reserved keywords as column names. I see that you have a column named 'DateTime' that you are casting to 'Date' and I can promise you that you will come to regret that design.", "human_label_sentiment": 0}
{"id": 125008710, "type": "c", "labeled_sentiment": 2, "text": "Thanks for your comment. I can't seem to get it to work, though. When I try these lines I get a runtime error: \"select method of range class failed\". Do you know how to solve this?", "human_label_sentiment": 2}
{"id": 70750465, "type": "p", "labeled_sentiment": 1, "text": "Let's understand how arrays work: In here, the name of the array i.e. arr acts as the pointer to the first element of the array. However, do note that it is NOT the pointer to the first element to avoid confusion, it just have an implicit conversion to pointer of element type. More details can be found here: http Now since array is contiguous, the rest of the elements can be determined. Now coming to your question, I'll convert my example to a string one: Note that the above assignment of will give you a warning: The pointer only holds the address of the first element of the array, so when you dereference the pointer, it prints the first element, i.e. is interpreted as Now there's an overload of , so what it does is if it sees a character pointer i.e. , it prints the complete null-terminated string, that's why in your case too, it is printing the whole string.", "human_label_sentiment": 1}
{"id": 125105176, "type": "c", "labeled_sentiment": 2, "text": "Ah, I missed \"if said group is larger than 2\" in OP. I was guiding by the desired output which contradicts the statement. It would be nice for @user to clarify the problem.", "human_label_sentiment": 1}
{"id": 125273014, "type": "c", "labeled_sentiment": 1, "text": "I've updated the answer from using strings to using an enum.", "human_label_sentiment": 1}
{"id": 125165026, "type": "c", "labeled_sentiment": 1, "text": "hey i replaced the part of (from: lastCommunicationDate)! to (from: currentVechicle.LastCommunicationDate!) but its getting an error for nil value", "human_label_sentiment": 1}
{"id": 125108715, "type": "c", "labeled_sentiment": 1, "text": "Well, if you attempt to login a user, won't it tell you that it isn't verified?", "human_label_sentiment": 1}
{"id": 70811425, "type": "p", "labeled_sentiment": 1, "text": "You have an invisible Zero-Width Joiner between and and again after Here is your script without it", "human_label_sentiment": 1}
{"id": 70852105, "type": "p", "labeled_sentiment": 2, "text": "Credit to @user There is no need for a clause in my case. This outputs all the columns and their corresponding count of recurring jobs. I hope this is useful.", "human_label_sentiment": 2}
{"id": 125212582, "type": "c", "labeled_sentiment": 1, "text": "You left out the definition of the attribute, which — if you do it like the OP did — will result in a potentially huge (as in having 10**7 elements) list being created. This means the cleverness of returning an instance might be for naught…", "human_label_sentiment": 1}
{"id": 136792219, "type": "c", "labeled_sentiment": 0, "text": "Not sure this answer is very helpful, for me removing the CreateIfNotExists() line works", "human_label_sentiment": 0}
{"id": 125279892, "type": "c", "labeled_sentiment": 2, "text": "Thanks for the help. This was a naive way to find if the given string is a palindrome.", "human_label_sentiment": 2}
{"id": 74978309, "type": "p", "labeled_sentiment": 0, "text": "You can use a Singleton like this http (sorry for the ugly website, but it's a basic concept), it's not necessary but it's one of your options.", "human_label_sentiment": 1}
{"id": 75014135, "type": "p", "labeled_sentiment": 1, "text": "I have an angular project that in embedded inside a CMS,  What this means is that the actual files for the app reside in the folder www.MyApp.com/Modules/App/dist/ http but the app is served from www.MyApp.com/app http I have the build script use and I use a small gulp script to update any hard coded assets in the index.html file. but that is now being depricated.\nI tried removing that cli option and updating my angular.json build options to use: as well as adding the following to my providers in app.module as was suggested by this comment on github http But the app does not load at all with that and if I set the base href to '/' it looks for all the assets and scripts in the www.MyApp.com/dist http folder. I am also using a HashLocationStrategy because the app is not served form the root of the website which ends with www.MyApp.com/app#/dashboard http where dashboard is the root router option I need help to move away from the deploy-url cli option in our build process.  How should I set the base href options for this. (Side note, I am open to using a different LocationStrategy if needed)", "human_label_sentiment": 1}
{"id": 75025979, "type": "p", "labeled_sentiment": 2, "text": "I am having trouble connecting the spring boot app to mysql.\nI use Docker, SpringBoot, Mysql.(not use Docker compose) when i command \"docker build -t springbootmysql .\", error occurred\nThe error is below. application.properties is bellow. Database is below. Docker names are below. enter image description here http I appreciate for your help. i checked the application.properties...", "human_label_sentiment": 0}
{"id": 132433648, "type": "c", "labeled_sentiment": 0, "text": "Its not clear to me how the data in table 1 is transformed into the data in table 2? I feel like you are missing a lot of sample data.", "human_label_sentiment": 0}
{"id": 132543450, "type": "c", "labeled_sentiment": 0, "text": "Ah ha,  The indentation does shed light on what is going on.\nThe ElseIf's are associated with the outer If True, not the inner one-liner If WD.  So yeah they will never do anything.\nWondering now if an outer If False and change the inner If WD to and ElseIf the way expected.  Don't know if I would do it that way but may give it a try just to see if it works.", "human_label_sentiment": 1}
{"id": 132491788, "type": "c", "labeled_sentiment": 1, "text": "ap_key is a string type variable. api_endpoint is also string type and  is web address on which the backend server is running . Params is an object which is passedin get method where you place api_key and other required parameters like location etc.", "human_label_sentiment": 1}
{"id": 75113987, "type": "p", "labeled_sentiment": 2, "text": "I am attempting to send a request from an android application to my laptop. This is currently resulting in the following exception being thrown. I have confirmed that the IP and the port are correct. Below I have attached both the server proto file and the apps proto file, along with the execution from the app. Server Proto file Apps Proto file App execution Android manifest All help is appreciated. Thanks! I have attempted to run this on different ports. I have also dropped all firewalls on my laptop to rule out that.\nI am also using android 23 and above for the app.", "human_label_sentiment": 2}
{"id": 75104777, "type": "p", "labeled_sentiment": 0, "text": "When I try to do some parallel Computing in a loop, it returns errors: The only way I can find is: I expected I can re-assign a new pool in each iteration, but it seemed not to work. What happened?", "human_label_sentiment": 1}
{"id": 132599314, "type": "c", "labeled_sentiment": 1, "text": "Recommendation: rather than two parallel arrays, consider making a structure to contain the big and end values and have an array of that. Usually a bit faster and a lot easier to manipulate.", "human_label_sentiment": 1}
{"id": 132648181, "type": "c", "labeled_sentiment": 2, "text": "Thank you @user for your answer, I realized it on the client side. So now another problem accrued, I have to pass HTTP status code: 301.", "human_label_sentiment": 2}
{"id": 132684713, "type": "c", "labeled_sentiment": 0, "text": "I hate it when I start typing an answer and the question gets closed.", "human_label_sentiment": 0}
{"id": 132738339, "type": "c", "labeled_sentiment": 2, "text": "Thank you very much, yes you are right as well with the -f, lets see if i can get it done with it!", "human_label_sentiment": 2}
{"id": 75248498, "type": "p", "labeled_sentiment": 2, "text": "Ok, To all those who may come across this question, this is a problem I have been banging my head against for the past two weeks and have made little or no progress, so any help would be extremely welcome. Here's the set up; then I will follow with an excerpt of the code I have written: I am writing a function to get a very specific formula for each file name in a given folder. This naturally requires me to write a program which can take string arguments (in this case, excel file names) from a very broad domain of possibilities and yield a very specific output based on some key -and highly unique- parameters. Hence, my function is bijective and the set of arguments and set of products are massive; therefore, I am in the process of writing a sub-process for this function which partitions the string argument, by character, into a corresponding array, remove all the unnecessary characters, concatenate the remaining characters into the output string, and then go through a series of checks to enforce whatever name-formula the file requires. For now, I am just focused on splitting the string into an array, removing all non-numeric characters and combining the remaining characters back into a single string. Naturally, I have tried the split function, but to my knowledge VBA doesn't support the splitting of a string into single characters. So I have written the following code, which, admittedly, is a bit inelegant, but I think in principle must work. -It does not. Would someone kindly tell me why it doesn't, and make a recommendation for altering it. arr() always returns empty, so newStr is always \"\". Yet there are always numeric values in each string argument. -I can't imagine why I am getting this result. If I use ReDim arr(Len(strArg)), I get Len(strArg) number of \" \" back.... Thanks in advance to whomever may provide help.", "human_label_sentiment": 1}
{"id": 75239249, "type": "p", "labeled_sentiment": 1, "text": "Well it is feasible to daisy-chain various connect app together as you can see in this minimal example: Therefore, your index.js should be:", "human_label_sentiment": 1}
{"id": 132775243, "type": "c", "labeled_sentiment": 2, "text": "@user Thank you for replying and testing it. I'm glad your issue was resolved. By your cooperation, I could correctly understand your question. Thank you, too.", "human_label_sentiment": 2}
{"id": 75249139, "type": "p", "labeled_sentiment": 2, "text": "I have two columns; both have integer values. One Representing years, and the other representing months.\nMy goal is to perform calculations in days (integer), so I have to convert both to calendar days,  to achieve that, taking in consideration that we have years with both 365 and 366 days. Example in pseudo code: The problem is when we have years = 10 (for example), we must take in account the fact that at least two of them have 366 days. The same with Months - we have 30 and 31 days. So I need to compensate that fact to get the most accurate possible value in days. Thanks in advance", "human_label_sentiment": 2}
{"id": 136144750, "type": "c", "labeled_sentiment": 0, "text": "Sorry, never saw you posted this. We released an update a while back that should have helped here. If it's not, maybe if you give me some details I could look into it.", "human_label_sentiment": 0}
{"id": 75292834, "type": "p", "labeled_sentiment": 1, "text": "I have a code that I want to turn from jupyter notebook into a script.\nIt's essentially pulling data from our Snowflake lake and doing some manipulations.\nHere is what its like in Jupyter Notebook: This works in Jupyter code. The data loads into the variable just fine. In the MS Visual studio code script, I have simply created a class for my purposes.\nHere is what it largely looks like: But for this, I keep on getting the below error From what I have searched, there is something about , but what if I am just fetching the rows and then later converting to dataframe.\nI am unable to understand why if it works in Jupyter, it is not working in my script too.", "human_label_sentiment": 1}
{"id": 132823169, "type": "c", "labeled_sentiment": 2, "text": "Happy to help..if the above answered your question, please mark it as such.", "human_label_sentiment": 2}
{"id": 132904171, "type": "c", "labeled_sentiment": 1, "text": "Can you show the Stored Proc that you used?", "human_label_sentiment": 1}
{"id": 75398468, "type": "p", "labeled_sentiment": 1, "text": "The code above is fine, the problem is with the upgraded project file. If I try in a new project, it works. Ended up creating a new project file. My upgrade wows continues.", "human_label_sentiment": 1}
